//=============================================================================//
.//■EXTRA [CG Gallery]■
//=============================================================================//
chapter main
{
	//★タイトルの状態
	$SYSTEM_menu_lock = true;

	$DebugMode=false;

	$CgFirst=true;
	GalleryBase();

	$CgPage=#CgPageIn;
	$CgPhase=#CgPhaseIn;

	$CgLoop=true;
	while($CgLoop){
		Gallery();
	}

	#CgPageIn=$CgPage;
	#CgPhaseIn=$CgPhase;

	CreateEffect("@システムエキストラ/背景", 2500, 0, 0, 1024, 576, "Plain");
	Request("@システムエキストラ/背景",Passive);

	Wait(16);
}

chapter main2
{
	Cg();

	//コングラ判定
	$CgWrite=false;
	CgWrite();
}




..//■基礎定義
function GalleryBase()
{
	$エキストラ画像=true;

	LoadImage("CgImage0", "cg/sys/extra/cg/空白アイコン.png");//hit領域
	LoadImage("CgImage1", "cg/sys/extra/cg/サムネイル謎.png");//無い場合
	LoadImage("CgImage2", "cg/sys/extra/cg/選択中.png");//over時の画像
	//LoadImage("CgImage3", "cg/sys/extra/cg/サムネイルボタンon.png");//Click時の画像
	LoadImage("NoData", "cg/sys/extra/cg/謎.png");//フルサイズのNO差分

	//■定義「背景」
	CreateTexture("CgBack", 1000, 0, 0, "cg/sys/extra/cg/背景.png");
	CreateTexture("CgMati", 1000, 0, -298, "cg/sys/extra/cg/町並み.png");

	//CreateTexture("CgGround2D", 1000, 0, 0, "cg/sys/extra/cg/背景_人物.png");
	//CreateTexture("CgGround3D", 1000, 0, 0, "cg/sys/extra/cg/背景_小道具.png");
	//CreateTexture("CgGroundBG", 1000, 0, 0, "cg/sys/extra/cg/背景_背景.png");
	CreateTexture("CgGround2D", 1000, 0, 0, "cg/sys/extra/cg/背景人物.png");
	CreateTexture("CgGround3D", 1000, 0, 0, "cg/sys/extra/cg/背景小道具他.png");
	CreateTexture("CgGroundBG", 1000, 0, 0, "cg/sys/extra/cg/背景背景.png");

	//CreateTexture("CgButton2D", 1000, 49, 79, "cg/sys/extra/cg/ページボタンベース人物.png");
	//CreateTexture("CgButton3D", 1000, 49, 79, "cg/sys/extra/cg/ページボタンベース小道具他.png");
	//CreateTexture("CgButtonBG", 1000, 49, 79, "cg/sys/extra/cg/ページボタンベース背景.png");

	CreateTexture("CgBase", 1000, 147, 73, "cg/sys/extra/cg/サムネイルベース.png");
	CreateTexture("CgPlate", 1000, 896, 52, "cg/sys/extra/cg/タイトル.png");

	//■各種定義
	//Array($CgNutName,"2D","3D","BG","Back","Next","Exit");
	//AssocArray($CgNutName,"2D","3D","BG","Back","Next","Exit");
	Array($CgNutName,"2D","3D","BG","Exit","P1","P2","P3","P4","P5","P6","P7","P8","P9","P10");
	AssocArray($CgNutName,"2D","3D","BG","Exit","P1","P2","P3","P4","P5","P6","P7","P8","P9","P10");

	Array($CgNutName["2D"],148,0,true,タブ人物,"2D");
	Array($CgNutName["3D"],628,0,true,タブ小道具他,"3D");
	Array($CgNutName["BG"],388,0,true,タブ背景,BG);

//	Array($CgNutName["Back"],912,438,true,前頁,Back);
//	Array($CgNutName["Next"],862,438,true,次頁,Next);
	Array($CgNutName["Exit"],926,456,true,戻るボタン,Exit);

	Array($CgNutName["P1"],62,114,true,p01_,"P1");
	Array($CgNutName["P2"],62,152,true,p02_,"P2");
	Array($CgNutName["P3"],62,190,true,p03_,"P3");
	Array($CgNutName["P4"],62,228,true,p04_,"P4");
	Array($CgNutName["P5"],62,266,true,p05_,"P5");
	Array($CgNutName["P6"],62,304,true,p06_,"P6");
	Array($CgNutName["P7"],62,342,true,p07_,"P7");
	Array($CgNutName["P8"],62,380,true,p08_,"P8");
	Array($CgNutName["P9"],62,418,true,p09_,"P9");
	Array($CgNutName["P10"],62,456,true,p10_,"P10");
//	Array($CgNutName["P11"],62,494,true,p11_,"P11");

	$WhileCount=0;
	while(Count($CgNutName)>$WhileCount){
		if($CgNutName[$WhileCount][2]){
			$CgX=$CgNutName[$WhileCount][0];
			$CgY=$CgNutName[$WhileCount][1];

			$CgNutBase="Cg"+$CgNutName[$WhileCount];
			CreateChoice($CgNutBase);
			SetAlias($CgNutBase, $CgNutBase);

			$CgNutImage1="cg/sys/extra/cg/"+$CgNutName[$WhileCount][3]+"off.png";
			$CgNutImage2="cg/sys/extra/cg/"+$CgNutName[$WhileCount][3]+"over.png";
			$CgNutImage3="cg/sys/extra/cg/"+$CgNutName[$WhileCount][3]+"on.png";

			$CgNutTemp1=$CgNutBase+"/img";
			CreateTexture($CgNutTemp1, 1000, $CgX, $CgY, $CgNutImage1);

			if($CgNutName[$WhileCount]!="Next"&&$CgNutName[$WhileCount]!="Back"&&$CgNutName[$WhileCount]!="Exit"){
				$CgNutTemp2=$CgNutBase+"/img2";
				CreateTexture($CgNutTemp2, 1000, $CgX, $CgY, $CgNutImage3);
			}
			$CgNutHit=$CgNutBase+"/MouseUsual/hit";
			CreateTexture($CgNutHit, 1000, $CgX, $CgY, $CgNutImage1);
			$CgNutOver=$CgNutBase+"/MouseOver/nut";
			CreateTexture($CgNutOver, 1000, $CgX, $CgY, $CgNutImage2);
			$CgNutClick=$CgNutBase+"/MouseClick/nut";
			CreateTexture($CgNutClick, 1000, $CgX, $CgY, $CgNutImage3);
			Request($CgNutHit, "Erase");
		}
		$WhileCount++;
	}


	//■ＣＧ変数定義
	if(!$PLACE_title){
		Cg();
	}

	//ページ合計書き出し
	$CgWrite=false;
	CgWrite();
}


..//★連想配列
function Cg()
{
	//★ロック設置
	//LockVideo(true);

	//■選択肢
	Array(#CgCategory,"2D","3D","BG");
	AssocArray(#CgCategory,"2D","3D","BG");

	$CgWhile=0;
	while(Count(#CgCategory)>$CgWhile){
		#CgOnCount[$CgWhile]=0;
		#CgCount[$CgWhile]=0;
		#CgCategory[$CgWhile][0]=0;
		$CgWhile++;
	}

	Array(#Cg,"何か","ev0000沙紅羅原付ライダーa","ev1800沙紅羅夜露死苦","ev1800千秋は夜の蝶になる","ev1800ユージロー事故a","ev1800ユージロー転倒a","ev0000恵那これは事件！？","ev1800ノーコ雨風に濡れる","ev1800フウリミヅハに肉まんあげるa","ev1820千秋てめぇに娘とブルマはやらん","ev1830鈴ドロップキック","ev1830フウリ天才ドラムマニア","ev1840ノーコフェラチオa","ev1840ノーコ同人誌再現正常位a","ev1850沙紅羅アキバに立つ","ev0000沙紅羅木刀アタック","ev1900恵那アザナエル発見","ev1900沙紅羅ウィリーアタック","ev1920千秋しまぱんa","ev1930みそロケボーダッシュa","ev1930似鳥双六に脅される","ev0000歌門破魔弓","ev1950沙紅羅が似鳥に土下座a","ev2000沙紅羅同人誌ビリビリ","ev2020カゴメアソビ1a","ev2110恵那水没","ev2210沙紅羅ストリップa","ev2210沙紅羅銃フェラa","ev2210沙紅羅正常位a","ev2210沙紅羅正常位深くa","ev2050カゴメアソビ2","ev2220太四郎ビル大破壊","ev2230似鳥臨死体験","ev2230似鳥堕皇降臨a","ev2250沙紅羅銃構え","ev2330ノーコスカートの中の戦争a","ev2330ノーコ似鳥靴コキa","ev2330ミヅハ歌門キスa","ev2330ミヅハ歌門潮吹きa","ev2330ミヅハ歌門対面座位a","ev2330ミヅハ歌門バックa","ev2220千秋恵那押し倒しa","ev2220千秋恵那コックコックこんにちわa","ev2220千秋恵那手マンa","ev2220千秋恵那ラブラブ正常位a","ev2120ノーコ告白a","ev0000ノーコカッターc","ev2130沙紅羅双六に一目惚れa","ev2140ノーコ似鳥を刺すa","ev2150沙紅羅対ノーコ","ev2230カゴメアソビ3a","ev2300フウリ鈴と抱擁号泣","ev2250カゴメアソビ4a","ev2250フウリ貫太と再会","ev2250千秋オブデス","ev2300フウリチュー手コキa","ev2300フウリバックa","ev2300フウリ騎乗位a","ev0000ノーコカッターa","ev2320カゴメアソビ5","ev2320フウリパイズリフェラa","ev2320恵那双六にレイプ未遂a","ev2320沙紅羅千秋と地下鉄チェイスa","ev2330似鳥お絵かきタイム","ev2330沙紅羅雪夜乃特攻隊","ev2340恵那対ジャブル","ev2350双六歌門を人質に取る","ev2350ミヅハノメ銃構え","ev2350第一宇宙速度年越しライブ","ev2400恵那千秋変わらない日常","ev2400似鳥ノーコ一番大切なもの","ev2400フウリタイコを叩きます_big","ev2400カゴメアソビ6a_big","ev9999おめでとう画像","bg0101100秋葉原_裏通り_通常","bg0101111秋葉原_裏通り_通常","bg0101200秋葉原_裏通り_閉店","bg0102100秋葉原_ガード下_通常","bg0102111秋葉原_ガード下_通常","bg0102200秋葉原_ガード下_閉店","bg0102300秋葉原_ガード下_破壊","bg0102400秋葉原_ガード下_雪","bg0103100秋葉原_中央通り_通常","bg0103111秋葉原_中央通り_通常","bg0103200秋葉原_中央通り_閉店","bg0103211秋葉原_中央通り_閉店","bg0104100秋葉原_万世橋_通常","bg0104111秋葉原_万世橋_通常","bg0104200秋葉原_万世橋_閉店","bg0104300秋葉原_万世橋_雪","bg0106100秋葉原_蔵前橋通り_通常","bg0107100秋葉原_遠景_通常","bg0107111秋葉原_遠景_通常","bg0107200秋葉原_遠景_閉店","bg0107300秋葉原_遠景_雪","bg0107400秋葉原_遠景_破壊","bg0108100秋葉原_俯瞰_通常","bg0108200秋葉原_俯瞰_閉店","bg0108300秋葉原_俯瞰_雪","bg0108400秋葉原_俯瞰_崩壊","bg0201100秋葉原駅_正面_通常","bg0201111秋葉原駅_正面_通常","bg0201112秋葉原駅_正面_通常","bg0201200秋葉原駅_正面_閉店","bg0201211秋葉原駅_正面_閉店","bg0201300秋葉原駅_正面_雪","bg0301100あにのあな_正面_通常","bg0301111あにのあな_正面_通常","bg0301200あにのあな_正面_停電","bg0301211あにのあな_正面_停電","bg0302100あにのあな_店内_通常","bg0302111あにのあな_店内_通常","bg0302200あにのあな_店内_停電","bg0302211あにのあな_店内_停電","bg0303100あにのあな_屋上_通常","bg0401100アキバスポット_正面_通常","bg0401200アキバスポット_正面_クリマン崩れ","bg0401300アキバスポット_正面_修復後","bg0401400アキバスポット_正面_車なし","bg0501100スーパーノヴァ_正面_通常","bg0501111スーパーノヴァ_正面_通常","bg0501200スーパーノヴァ_正面_ガラス割れ","bg0501300スーパーノヴァ_正面_ガラス補修","bg0501400スーパーノヴァ_正面_ガラス車イン","bg0501500スーパーノヴァ_正面_ガラス割れタイヤ痕","bg0501600スーパーノヴァ_正面_ガラス補修車イン","bg0501700スーパーノヴァ_正面_ガラス補修タイヤ痕","bg0502100スーパーノヴァ_ライブ会場_ガラス割れ","bg0502100スーパーノヴァ_ライブ会場_通常","bg0502111スーパーノヴァ_ライブ会場_ガラス割れ","bg0502111スーパーノヴァ_ライブ会場_通常","bg0502200スーパーノヴァ_ライブ会場_ガラス補修","bg0502200スーパーノヴァ_ライブ会場_消灯","bg0502211スーパーノヴァ_ライブ会場_ガラス補修","bg0502211スーパーノヴァ_ライブ会場_消灯","bg0502300スーパーノヴァ_ライブ会場_ガラス車イン","bg0502300スーパーノヴァ_ライブ会場_地震後","bg0502400スーパーノヴァ_ライブ会場_ガラス補修車イン","bg0503100スーパーノヴァ_控え室_通常","bg0601100半田明神_男坂_通常","bg0601200半田明神_男坂_雪","bg0601211半田明神_男坂_雪","bg0602100半田明神_鳥居_通常","bg0602111半田明神_鳥居_通常","bg0602112半田明神_鳥居_通常","bg0602200半田明神_鳥居_ペンキ","bg0602211半田明神_鳥居_ペンキ","bg0602300半田明神_鳥居_雪","bg0602311半田明神_鳥居_雪","bg0603100半田明神_境内_通常","bg0603111半田明神_境内_通常","bg0603200半田明神_境内_ペンキ","bg0603300半田明神_境内_雪ライブ","bg0603311半田明神_境内_雪ライブ","bg0603400半田明神_境内_ノーマル新年","bg0603411半田明神_境内_ノーマル新年","bg0603500半田明神_境内_雪ノーマル新年","bg0603511半田明神_境内_雪ノーマル新年","bg0603600半田明神_境内_雪トゥルー新年","bg0603611半田明神_境内_雪トゥルー新年","bg0603700半田明神_境内_厭覇薔薇新年","bg0603711半田明神_境内_厭覇薔薇新年","bg0603800半田明神_境内_雪ノーマル新年新カンダー","bg0603811半田明神_境内_雪ノーマル新年新カンダー","bg0603900半田明神_境内_厭覇薔薇新年新カンダー","bg0603911半田明神_境内_厭覇薔薇新年新カンダー","bg0604100半田明神_社務所_通常","bg0604111半田明神_社務所_通常","bg0604112半田明神_社務所_通常","bg0604200半田明神_社務所_雪","bg0604211半田明神_社務所_雪","bg0604212半田明神_社務所_雪","bg0605100半田明神_屋根_通常","bg0605200半田明神_屋根_ペンキ","bg0605300半田明神_屋根_雪","bg0606100半田明神_涸れ井戸_通常","bg0606200半田明神_涸れ井戸_雪","bg0607100半田明神_拝殿_通常","bg0607200半田明神_拝殿_ソトカンダー","bg0607300半田明神_拝殿_布地","bg0701100地下_通路_通常","bg0701200地下_通路_地震後","bg0701300地下_通路_水","bg0701400地下_通路_あにのあな","bg0701500地下_通路_スパコン館","bg0701600地下_通路_バックギャモン","bg0702100地下_祭壇_通常","bg0702200地下_祭壇_閉門","bg0703100地下_地下鉄_通常","bg0801100籠_正面_通常","bg0801200籠_正面_ブラックライト","bg0801300籠_正面_激流","bg0802100籠_内部_通常","bg0901100エレキセンター_廊下_通常","bg0901200エレキセンター_廊下_閉店","bg0902100エレキセンター_ジャガンナート_通常","bg1001100バックギャモン_正面_通常","bg1002100バックギャモン_店内_通常","bg1101100スパコン館_裏面_通常","bg1101111スパコン館_裏面_通常","bg1101200スパコン館_裏面_閉店","bg1101300スパコン館_裏面_電柱折れ","bg1101400スパコン館_裏面_半廃墟","bg1101500スパコン館_裏面_廃墟","bg1102100スパコン館_通路_通常","bg1102200スパコン館_通路_半崩壊","bg1103100スパコン館_店内_通常","bg1103200スパコン館_店内_半崩壊","bg1104100スパコン館_スタジオ_通常","bg1201100ＵＰ＋_屋外セット_通常","bg1201111ＵＰ＋_屋外セット_通常","bg1201200ＵＰ＋_屋外セット_炎上","bg1201211ＵＰ＋_屋外セット_炎上","bg1201300ＵＰ＋_屋外セット_暗闇","bg1201311ＵＰ＋_屋外セット_暗闇","bg1202100ＵＰ＋_セット上_通常","bg1202200ＵＰ＋_セット上_暗闇","bg1202300ＵＰ＋_セット上_炎上","bg1203100ＵＰ＋_セット裏_通常","bg1203200ＵＰ＋_セット裏_暗闇","bg1301100似鳥マンション_エントランス_通常","bg1302100似鳥マンション_正面_通常","bg1302200似鳥マンション_正面_亀裂","bg1302300似鳥マンション_正面_亀裂補修","bg1303100似鳥マンション_玄関_通常","bg1303200似鳥マンション_玄関_カレー","bg1304100似鳥マンション_リビング_通常","bg1304200似鳥マンション_リビング_同人誌散乱","bg1304300似鳥マンション_リビング_掃除後","bg1401100泰然堂大学病院_正面_通常","bg1402100泰然堂大学病院_病室_通常","bg1403100泰然堂大学病院_廊下_通常","bg1404100泰然堂大学病院_霊安室_通常","bg1501100柳神社_境内_通常","bg1501200柳神社_境内_雪","bg1502100柳神社_お墓_通常","bg1502200柳神社_お墓_雪","bg1601100小碓家_正面_通常","bg1601100小碓家_自室_通常","bg1602100小碓家_自室過去_通常","bg1701100銭形公園_全景_通常","bg1701200銭形公園_全景_夕","bg1702100銭形公園_トイレ正面_通常","bg1703100銭形公園_トイレ中_通常","bg1703200銭形公園_トイレ中_奧閉まる","bg1703300銭形公園_トイレ中_破壊","bg1704100銭形公園_トイレ個室_通常","bg1704200銭形公園_トイレ個室_水没","bg1801100ドンガ・バチョ_家電売り場_通常","bg1801111ドンガ・バチョ_家電売り場_通常","bg1901100ショウビル_正面_通常","bg1901111ショウビル_正面_通常","bg2001100ビッグサイト_正面_通常","bg2001111ビッグサイト_正面_通常","bg2101100プリーズ_店内_通常","bg2201100屋島_古戦場_通常","bg2301100パチンコ屋_正面_通常","bg2301111パチンコ屋_正面_通常","bg2302100パチンコ屋_店内_通常","bg2302111パチンコ屋_店内_通常","bg2401100空_上空_通常","bg2501100信号機_見上げ_青","bg2501200信号機_見上げ_黄","bg2501300信号機_見上げ_赤","bg2502100信号機_見上げ_青標識無","bg2502200信号機_見上げ_黄標識無","bg2502300信号機_見上げ_赤標識無","bg2601100電柱_見上げ_通常","img金閣寺イメージ絵","img金閣寺水面に揺れる","imgタヌキの携帯ストラップ","imgノーコントロール01","imgノーコントロール10","imgノーコントロール11","imgノーコントロール11中身","imgスマガＤＳ","imgフウリの手紙","imgエコバッグ_沙紅羅2350","img引き裂かれた同人誌が夜空に舞う","img引き裂かれた同人誌が地面に散らばる","imgイタバイク駐車","imgカッター全体","imgカッター刃元a","imgカッター刃元b","imgソトカンダーイラスト","imgソトカンダー真イラスト","imgソトカンダー真イラスト_big","imgソトカンダー落下","img路肩","imgエコバッグ_千秋1820","img縞パン","imgネットトレードＰＣ画面","imgスカイプシーンa","imgスカイプシーンb","img地下通路の矢印","img双六死に手","imgノーコリスカ実体a","imgノーコリスカ実体b","imgノーコリスカ実体c","imgノーコリスカ実体d","imgノーコリスカイメージa","imgノーコリスカイメージb","img戦後の秋葉原","imgアザナエルb","imgアザナエル","img河原屋双一","imgクリマン断面図","img迫り来る村崎のトラック","img平次双六に足を折られる","imgアザナエルマズル弾なし","imgノーコントロール車の荷台から溢れる","img古銭飛来","img2chシーン似鳥2330","img沙紅羅双六の腕をへし折る","imgミリＰ車","imgミリＰ車飛翔","img花火","obj肉まん","obj千秋ネームプレートa","obj千秋ネームプレートb","obj御札","objエコバッグ","objエコバッグ_ノーコ2030a","objエコバッグ_ノーコ2030b","objエコバッグ_恵那1900","objエコバッグ_恵那1910","objエコバッグ_千秋_フウリ18","objヘルメットa","objヘルメットb","objノーカロリーコンニャク","objクリマン","objノートＰＣ","objタヌキ小走り","objタヌキ小走り_横長","objソトカンダー落下演出","objフウリ葉っぱの手紙変化前","objフウリ葉っぱの手紙変化後","obj恵那携帯ストラップ","obj千秋携帯ストラップ","obj平次の頭","objロクロー名刺","objアザナエル弾丸","obj太三郎の葉っぱ");


	AssocArray(#Cg,"何か","ev0000沙紅羅原付ライダーa","ev1800沙紅羅夜露死苦","ev1800千秋は夜の蝶になる","ev1800ユージロー事故a","ev1800ユージロー転倒a","ev0000恵那これは事件！？","ev1800ノーコ雨風に濡れる","ev1800フウリミヅハに肉まんあげるa","ev1820千秋てめぇに娘とブルマはやらん","ev1830鈴ドロップキック","ev1830フウリ天才ドラムマニア","ev1840ノーコフェラチオa","ev1840ノーコ同人誌再現正常位a","ev1850沙紅羅アキバに立つ","ev0000沙紅羅木刀アタック","ev1900恵那アザナエル発見","ev1900沙紅羅ウィリーアタック","ev1920千秋しまぱんa","ev1930みそロケボーダッシュa","ev1930似鳥双六に脅される","ev0000歌門破魔弓","ev1950沙紅羅が似鳥に土下座a","ev2000沙紅羅同人誌ビリビリ","ev2020カゴメアソビ1a","ev2110恵那水没","ev2210沙紅羅ストリップa","ev2210沙紅羅銃フェラa","ev2210沙紅羅正常位a","ev2210沙紅羅正常位深くa","ev2050カゴメアソビ2","ev2220太四郎ビル大破壊","ev2230似鳥臨死体験","ev2230似鳥堕皇降臨a","ev2250沙紅羅銃構え","ev2330ノーコスカートの中の戦争a","ev2330ノーコ似鳥靴コキa","ev2330ミヅハ歌門キスa","ev2330ミヅハ歌門潮吹きa","ev2330ミヅハ歌門対面座位a","ev2330ミヅハ歌門バックa","ev2220千秋恵那押し倒しa","ev2220千秋恵那コックコックこんにちわa","ev2220千秋恵那手マンa","ev2220千秋恵那ラブラブ正常位a","ev2120ノーコ告白a","ev0000ノーコカッターc","ev2130沙紅羅双六に一目惚れa","ev2140ノーコ似鳥を刺すa","ev2150沙紅羅対ノーコ","ev2230カゴメアソビ3a","ev2300フウリ鈴と抱擁号泣","ev2250カゴメアソビ4a","ev2250フウリ貫太と再会","ev2250千秋オブデス","ev2300フウリチュー手コキa","ev2300フウリバックa","ev2300フウリ騎乗位a","ev0000ノーコカッターa","ev2320カゴメアソビ5","ev2320フウリパイズリフェラa","ev2320恵那双六にレイプ未遂a","ev2320沙紅羅千秋と地下鉄チェイスa","ev2330似鳥お絵かきタイム","ev2330沙紅羅雪夜乃特攻隊","ev2340恵那対ジャブル","ev2350双六歌門を人質に取る","ev2350ミヅハノメ銃構え","ev2350第一宇宙速度年越しライブ","ev2400恵那千秋変わらない日常","ev2400似鳥ノーコ一番大切なもの","ev2400フウリタイコを叩きます_big","ev2400カゴメアソビ6a_big","ev9999おめでとう画像","bg0101100秋葉原_裏通り_通常","bg0101111秋葉原_裏通り_通常","bg0101200秋葉原_裏通り_閉店","bg0102100秋葉原_ガード下_通常","bg0102111秋葉原_ガード下_通常","bg0102200秋葉原_ガード下_閉店","bg0102300秋葉原_ガード下_破壊","bg0102400秋葉原_ガード下_雪","bg0103100秋葉原_中央通り_通常","bg0103111秋葉原_中央通り_通常","bg0103200秋葉原_中央通り_閉店","bg0103211秋葉原_中央通り_閉店","bg0104100秋葉原_万世橋_通常","bg0104111秋葉原_万世橋_通常","bg0104200秋葉原_万世橋_閉店","bg0104300秋葉原_万世橋_雪","bg0106100秋葉原_蔵前橋通り_通常","bg0107100秋葉原_遠景_通常","bg0107111秋葉原_遠景_通常","bg0107200秋葉原_遠景_閉店","bg0107300秋葉原_遠景_雪","bg0107400秋葉原_遠景_破壊","bg0108100秋葉原_俯瞰_通常","bg0108200秋葉原_俯瞰_閉店","bg0108300秋葉原_俯瞰_雪","bg0108400秋葉原_俯瞰_崩壊","bg0201100秋葉原駅_正面_通常","bg0201111秋葉原駅_正面_通常","bg0201112秋葉原駅_正面_通常","bg0201200秋葉原駅_正面_閉店","bg0201211秋葉原駅_正面_閉店","bg0201300秋葉原駅_正面_雪","bg0301100あにのあな_正面_通常","bg0301111あにのあな_正面_通常","bg0301200あにのあな_正面_停電","bg0301211あにのあな_正面_停電","bg0302100あにのあな_店内_通常","bg0302111あにのあな_店内_通常","bg0302200あにのあな_店内_停電","bg0302211あにのあな_店内_停電","bg0303100あにのあな_屋上_通常","bg0401100アキバスポット_正面_通常","bg0401200アキバスポット_正面_クリマン崩れ","bg0401300アキバスポット_正面_修復後","bg0401400アキバスポット_正面_車なし","bg0501100スーパーノヴァ_正面_通常","bg0501111スーパーノヴァ_正面_通常","bg0501200スーパーノヴァ_正面_ガラス割れ","bg0501300スーパーノヴァ_正面_ガラス補修","bg0501400スーパーノヴァ_正面_ガラス車イン","bg0501500スーパーノヴァ_正面_ガラス割れタイヤ痕","bg0501600スーパーノヴァ_正面_ガラス補修車イン","bg0501700スーパーノヴァ_正面_ガラス補修タイヤ痕","bg0502100スーパーノヴァ_ライブ会場_ガラス割れ","bg0502100スーパーノヴァ_ライブ会場_通常","bg0502111スーパーノヴァ_ライブ会場_ガラス割れ","bg0502111スーパーノヴァ_ライブ会場_通常","bg0502200スーパーノヴァ_ライブ会場_ガラス補修","bg0502200スーパーノヴァ_ライブ会場_消灯","bg0502211スーパーノヴァ_ライブ会場_ガラス補修","bg0502211スーパーノヴァ_ライブ会場_消灯","bg0502300スーパーノヴァ_ライブ会場_ガラス車イン","bg0502300スーパーノヴァ_ライブ会場_地震後","bg0502400スーパーノヴァ_ライブ会場_ガラス補修車イン","bg0503100スーパーノヴァ_控え室_通常","bg0601100半田明神_男坂_通常","bg0601200半田明神_男坂_雪","bg0601211半田明神_男坂_雪","bg0602100半田明神_鳥居_通常","bg0602111半田明神_鳥居_通常","bg0602112半田明神_鳥居_通常","bg0602200半田明神_鳥居_ペンキ","bg0602211半田明神_鳥居_ペンキ","bg0602300半田明神_鳥居_雪","bg0602311半田明神_鳥居_雪","bg0603100半田明神_境内_通常","bg0603111半田明神_境内_通常","bg0603200半田明神_境内_ペンキ","bg0603300半田明神_境内_雪ライブ","bg0603311半田明神_境内_雪ライブ","bg0603400半田明神_境内_ノーマル新年","bg0603411半田明神_境内_ノーマル新年","bg0603500半田明神_境内_雪ノーマル新年","bg0603511半田明神_境内_雪ノーマル新年","bg0603600半田明神_境内_雪トゥルー新年","bg0603611半田明神_境内_雪トゥルー新年","bg0603700半田明神_境内_厭覇薔薇新年","bg0603711半田明神_境内_厭覇薔薇新年","bg0603800半田明神_境内_雪ノーマル新年新カンダー","bg0603811半田明神_境内_雪ノーマル新年新カンダー","bg0603900半田明神_境内_厭覇薔薇新年新カンダー","bg0603911半田明神_境内_厭覇薔薇新年新カンダー","bg0604100半田明神_社務所_通常","bg0604111半田明神_社務所_通常","bg0604112半田明神_社務所_通常","bg0604200半田明神_社務所_雪","bg0604211半田明神_社務所_雪","bg0604212半田明神_社務所_雪","bg0605100半田明神_屋根_通常","bg0605200半田明神_屋根_ペンキ","bg0605300半田明神_屋根_雪","bg0606100半田明神_涸れ井戸_通常","bg0606200半田明神_涸れ井戸_雪","bg0607100半田明神_拝殿_通常","bg0607200半田明神_拝殿_ソトカンダー","bg0607300半田明神_拝殿_布地","bg0701100地下_通路_通常","bg0701200地下_通路_地震後","bg0701300地下_通路_水","bg0701400地下_通路_あにのあな","bg0701500地下_通路_スパコン館","bg0701600地下_通路_バックギャモン","bg0702100地下_祭壇_通常","bg0702200地下_祭壇_閉門","bg0703100地下_地下鉄_通常","bg0801100籠_正面_通常","bg0801200籠_正面_ブラックライト","bg0801300籠_正面_激流","bg0802100籠_内部_通常","bg0901100エレキセンター_廊下_通常","bg0901200エレキセンター_廊下_閉店","bg0902100エレキセンター_ジャガンナート_通常","bg1001100バックギャモン_正面_通常","bg1002100バックギャモン_店内_通常","bg1101100スパコン館_裏面_通常","bg1101111スパコン館_裏面_通常","bg1101200スパコン館_裏面_閉店","bg1101300スパコン館_裏面_電柱折れ","bg1101400スパコン館_裏面_半廃墟","bg1101500スパコン館_裏面_廃墟","bg1102100スパコン館_通路_通常","bg1102200スパコン館_通路_半崩壊","bg1103100スパコン館_店内_通常","bg1103200スパコン館_店内_半崩壊","bg1104100スパコン館_スタジオ_通常","bg1201100ＵＰ＋_屋外セット_通常","bg1201111ＵＰ＋_屋外セット_通常","bg1201200ＵＰ＋_屋外セット_炎上","bg1201211ＵＰ＋_屋外セット_炎上","bg1201300ＵＰ＋_屋外セット_暗闇","bg1201311ＵＰ＋_屋外セット_暗闇","bg1202100ＵＰ＋_セット上_通常","bg1202200ＵＰ＋_セット上_暗闇","bg1202300ＵＰ＋_セット上_炎上","bg1203100ＵＰ＋_セット裏_通常","bg1203200ＵＰ＋_セット裏_暗闇","bg1301100似鳥マンション_エントランス_通常","bg1302100似鳥マンション_正面_通常","bg1302200似鳥マンション_正面_亀裂","bg1302300似鳥マンション_正面_亀裂補修","bg1303100似鳥マンション_玄関_通常","bg1303200似鳥マンション_玄関_カレー","bg1304100似鳥マンション_リビング_通常","bg1304200似鳥マンション_リビング_同人誌散乱","bg1304300似鳥マンション_リビング_掃除後","bg1401100泰然堂大学病院_正面_通常","bg1402100泰然堂大学病院_病室_通常","bg1403100泰然堂大学病院_廊下_通常","bg1404100泰然堂大学病院_霊安室_通常","bg1501100柳神社_境内_通常","bg1501200柳神社_境内_雪","bg1502100柳神社_お墓_通常","bg1502200柳神社_お墓_雪","bg1601100小碓家_正面_通常","bg1601100小碓家_自室_通常","bg1602100小碓家_自室過去_通常","bg1701100銭形公園_全景_通常","bg1701200銭形公園_全景_夕","bg1702100銭形公園_トイレ正面_通常","bg1703100銭形公園_トイレ中_通常","bg1703200銭形公園_トイレ中_奧閉まる","bg1703300銭形公園_トイレ中_破壊","bg1704100銭形公園_トイレ個室_通常","bg1704200銭形公園_トイレ個室_水没","bg1801100ドンガ・バチョ_家電売り場_通常","bg1801111ドンガ・バチョ_家電売り場_通常","bg1901100ショウビル_正面_通常","bg1901111ショウビル_正面_通常","bg2001100ビッグサイト_正面_通常","bg2001111ビッグサイト_正面_通常","bg2101100プリーズ_店内_通常","bg2201100屋島_古戦場_通常","bg2301100パチンコ屋_正面_通常","bg2301111パチンコ屋_正面_通常","bg2302100パチンコ屋_店内_通常","bg2302111パチンコ屋_店内_通常","bg2401100空_上空_通常","bg2501100信号機_見上げ_青","bg2501200信号機_見上げ_黄","bg2501300信号機_見上げ_赤","bg2502100信号機_見上げ_青標識無","bg2502200信号機_見上げ_黄標識無","bg2502300信号機_見上げ_赤標識無","bg2601100電柱_見上げ_通常","img金閣寺イメージ絵","img金閣寺水面に揺れる","imgタヌキの携帯ストラップ","imgノーコントロール01","imgノーコントロール10","imgノーコントロール11","imgノーコントロール11中身","imgスマガＤＳ","imgフウリの手紙","imgエコバッグ_沙紅羅2350","img引き裂かれた同人誌が夜空に舞う","img引き裂かれた同人誌が地面に散らばる","imgイタバイク駐車","imgカッター全体","imgカッター刃元a","imgカッター刃元b","imgソトカンダーイラスト","imgソトカンダー真イラスト","imgソトカンダー真イラスト_big","imgソトカンダー落下","img路肩","imgエコバッグ_千秋1820","img縞パン","imgネットトレードＰＣ画面","imgスカイプシーンa","imgスカイプシーンb","img地下通路の矢印","img双六死に手","imgノーコリスカ実体a","imgノーコリスカ実体b","imgノーコリスカ実体c","imgノーコリスカ実体d","imgノーコリスカイメージa","imgノーコリスカイメージb","img戦後の秋葉原","imgアザナエルb","imgアザナエル","img河原屋双一","imgクリマン断面図","img迫り来る村崎のトラック","img平次双六に足を折られる","imgアザナエルマズル弾なし","imgノーコントロール車の荷台から溢れる","img古銭飛来","img2chシーン似鳥2330","img沙紅羅双六の腕をへし折る","imgミリＰ車","imgミリＰ車飛翔","img花火","obj肉まん","obj千秋ネームプレートa","obj千秋ネームプレートb","obj御札","objエコバッグ","objエコバッグ_ノーコ2030a","objエコバッグ_ノーコ2030b","objエコバッグ_恵那1900","objエコバッグ_恵那1910","objエコバッグ_千秋_フウリ18","objヘルメットa","objヘルメットb","objノーカロリーコンニャク","objクリマン","objノートＰＣ","objタヌキ小走り","objタヌキ小走り_横長","objソトカンダー落下演出","objフウリ葉っぱの手紙変化前","objフウリ葉っぱの手紙変化後","obj恵那携帯ストラップ","obj千秋携帯ストラップ","obj平次の頭","objロクロー名刺","objアザナエル弾丸","obj太三郎の葉っぱ");

	#CgCount=Count(#Cg);

Array(#Cg["ev0000沙紅羅原付ライダーa"],"2D","No","ev0000沙紅羅原付ライダーa","ev0000沙紅羅原付ライダーb");
Array(#Cg["ev1800沙紅羅夜露死苦"],"2D","Vr","ev1800沙紅羅夜露死苦");
Array(#Cg["ev1800千秋は夜の蝶になる"],"2D","No","ev1800千秋は夜の蝶になる");
Array(#Cg["ev1800ユージロー事故a"],"2D","No","ev1800ユージロー事故a","ev2210ユージロー事故b");
Array(#Cg["ev1800ユージロー転倒a"],"2D","No","ev1800ユージロー転倒a","ev2150ユージロー転倒b","ev2210ユージロー転倒c");
Array(#Cg["ev0000恵那これは事件！？"],"2D","No","ev0000恵那これは事件！？","ev0000恵那これは事件！？私服");
Array(#Cg["ev1800ノーコ雨風に濡れる"],"2D","No","ev1800ノーコ雨風に濡れる");
Array(#Cg["ev1800フウリミヅハに肉まんあげるa"],"2D","No","ev1800フウリミヅハに肉まんあげるa","ev1800フウリミヅハに肉まんあげるb");
Array(#Cg["ev1820千秋てめぇに娘とブルマはやらん"],"2D","No","ev1820千秋てめぇに娘とブルマはやらん");
Array(#Cg["ev1830鈴ドロップキック"],"2D","No","ev1830鈴ドロップキック");
Array(#Cg["ev1830フウリ天才ドラムマニア"],"2D","Vr","ev1830フウリ天才ドラムマニア","ev1830フウリ天才ドラムマニア鈴付");
Array(#Cg["ev1840ノーコフェラチオa"],"2D","No","ev1840ノーコフェラチオa","ev1840ノーコフェラチオb","ev1840ノーコフェラチオc","ev1840ノーコフェラチオd");
Array(#Cg["ev1840ノーコ同人誌再現正常位a"],"2D","No","ev1840ノーコ同人誌再現正常位a","ev1840ノーコ同人誌再現正常位b","ev1840ノーコ同人誌再現正常位c","ev1840ノーコ同人誌再現正常位d","ev1840ノーコ同人誌再現正常位e");
Array(#Cg["ev1850沙紅羅アキバに立つ"],"2D","No","ev1850沙紅羅アキバに立つ");
Array(#Cg["ev0000沙紅羅木刀アタック"],"2D","No","ev0000沙紅羅木刀アタック");
Array(#Cg["ev1900恵那アザナエル発見"],"2D","No","ev1900恵那アザナエル発見");
Array(#Cg["ev1900沙紅羅ウィリーアタック"],"2D","No","ev1900沙紅羅ウィリーアタック");
Array(#Cg["ev1920千秋しまぱんa"],"2D","No","ev1920千秋しまぱんa","ev1920千秋しまぱんb");
Array(#Cg["ev1930みそロケボーダッシュa"],"2D","No","ev1930みそロケボーダッシュa","ev1930みそロケボーダッシュb");
Array(#Cg["ev1930似鳥双六に脅される"],"2D","No","ev1930似鳥双六に脅される");
Array(#Cg["ev0000歌門破魔弓"],"2D","No","ev0000歌門破魔弓");
Array(#Cg["ev1950沙紅羅が似鳥に土下座a"],"2D","No","ev1950沙紅羅が似鳥に土下座a","ev1950沙紅羅が似鳥に土下座b");
Array(#Cg["ev2000沙紅羅同人誌ビリビリ"],"2D","No","ev2000沙紅羅同人誌ビリビリ");
Array(#Cg["ev2020カゴメアソビ1a"],"2D","No","ev2020カゴメアソビ1a","ev2020カゴメアソビ1b");
Array(#Cg["ev2110恵那水没"],"2D","No","ev2110恵那水没");
Array(#Cg["ev2210沙紅羅ストリップa"],"2D","No","ev2210沙紅羅ストリップa","ev2210沙紅羅ストリップb","ev2210沙紅羅ストリップc","ev2210沙紅羅ストリップd","ev2210沙紅羅ストリップe");
Array(#Cg["ev2210沙紅羅銃フェラa"],"2D","No","ev2210沙紅羅銃フェラa","ev2210沙紅羅銃フェラb","ev2210沙紅羅銃フェラc","ev2210沙紅羅銃フェラd","ev2210沙紅羅銃フェラe","ev2210沙紅羅銃フェラf","ev2210沙紅羅銃フェラg","ev2210沙紅羅銃フェラh");
Array(#Cg["ev2210沙紅羅正常位a"],"2D","No","ev2210沙紅羅正常位a","ev2210沙紅羅正常位b","ev2210沙紅羅正常位c");
Array(#Cg["ev2210沙紅羅正常位深くa"],"2D","No","ev2210沙紅羅正常位深くa","ev2210沙紅羅正常位深くb","ev2210沙紅羅正常位深くc","ev2210沙紅羅正常位深くd","ev2210沙紅羅正常位深くe");
Array(#Cg["ev2050カゴメアソビ2"],"2D","No","ev2050カゴメアソビ2");
Array(#Cg["ev2220太四郎ビル大破壊"],"2D","No","ev2220太四郎ビル大破壊","ev2220太四郎ビル大破壊b","ev2220太四郎ビル大破壊c","ev2220太四郎ビル大破壊d");
Array(#Cg["ev2230似鳥臨死体験"],"2D","No","ev2230似鳥臨死体験");
Array(#Cg["ev2230似鳥堕皇降臨a"],"2D","No","ev2230似鳥堕皇降臨a","ev2230似鳥堕皇降臨b","ev2230似鳥堕皇降臨c");
Array(#Cg["ev2250沙紅羅銃構え"],"2D","No","ev2250沙紅羅銃構え");
Array(#Cg["ev2330ノーコスカートの中の戦争a"],"2D","No","ev2330ノーコスカートの中の戦争a","ev2330ノーコスカートの中の戦争b","ev2330ノーコスカートの中の戦争c","ev2330ノーコスカートの中の戦争d");
Array(#Cg["ev2330ノーコ似鳥靴コキa"],"2D","No","ev2330ノーコ似鳥靴コキa","ev2330ノーコ似鳥靴コキb","ev2330ノーコ似鳥靴コキc","ev2330ノーコ似鳥靴コキd");
Array(#Cg["ev2330ミヅハ歌門キスa"],"2D","No","ev2330ミヅハ歌門キスa","ev2330ミヅハ歌門キスb");
Array(#Cg["ev2330ミヅハ歌門潮吹きa"],"2D","No","ev2330ミヅハ歌門潮吹きa","ev2330ミヅハ歌門潮吹きb","ev2330ミヅハ歌門潮吹きc","ev2330ミヅハ歌門潮吹きd","ev2330ミヅハ歌門潮吹きe","ev2330ミヅハ歌門潮吹きf","ev2330ミヅハ歌門潮吹きg");
Array(#Cg["ev2330ミヅハ歌門対面座位a"],"2D","No","ev2330ミヅハ歌門対面座位a","ev2330ミヅハ歌門対面座位b","ev2330ミヅハ歌門対面座位c","ev2330ミヅハ歌門対面座位d");
Array(#Cg["ev2330ミヅハ歌門バックa"],"2D","No","ev2330ミヅハ歌門バックa","ev2330ミヅハ歌門バックb","ev2330ミヅハ歌門バックc");
Array(#Cg["ev2220千秋恵那押し倒しa"],"2D","No","ev2220千秋恵那押し倒しa","ev2220千秋恵那押し倒しb","ev2220千秋恵那押し倒しc","ev2220千秋恵那押し倒しd","ev2220千秋恵那押し倒しe");
Array(#Cg["ev2220千秋恵那コックコックこんにちわa"],"2D","No","ev2220千秋恵那コックコックこんにちわa","ev2220千秋恵那コックコックこんにちわb","ev2220千秋恵那コックコックこんにちわc","ev2220千秋恵那コックコックこんにちわd","ev2220千秋恵那コックコックこんにちわe");
Array(#Cg["ev2220千秋恵那手マンa"],"2D","No","ev2220千秋恵那手マンa","ev2220千秋恵那手マンb","ev2220千秋恵那手マンc");
Array(#Cg["ev2220千秋恵那ラブラブ正常位a"],"2D","No","ev2220千秋恵那ラブラブ正常位a","ev2220千秋恵那ラブラブ正常位b","ev2220千秋恵那ラブラブ正常位c","ev2220千秋恵那ラブラブ正常位d");
Array(#Cg["ev2120ノーコ告白a"],"2D","No","ev2120ノーコ告白a","ev2120ノーコ告白b","ev2120ノーコ告白c","ev2120ノーコ告白d");
Array(#Cg["ev0000ノーコカッターc"],"2D","No","ev0000ノーコカッターc","ev0000ノーコカッターd");
Array(#Cg["ev2130沙紅羅双六に一目惚れa"],"2D","No","ev2130沙紅羅双六に一目惚れa","ev2130沙紅羅双六に一目惚れb");
Array(#Cg["ev2140ノーコ似鳥を刺すa"],"2D","No","ev2140ノーコ似鳥を刺すa","ev2140ノーコ似鳥を刺すb");
Array(#Cg["ev2150沙紅羅対ノーコ"],"2D","No","ev2150沙紅羅対ノーコ");
Array(#Cg["ev2230カゴメアソビ3a"],"2D","Vr","ev2230カゴメアソビ3a");
Array(#Cg["ev2300フウリ鈴と抱擁号泣"],"2D","No","ev2300フウリ鈴と抱擁号泣","ev2300フウリ鈴と抱擁号泣b");
Array(#Cg["ev2250カゴメアソビ4a"],"2D","No","ev2250カゴメアソビ4a","ev2250カゴメアソビ4b");
Array(#Cg["ev2250フウリ貫太と再会"],"2D","No","ev2250フウリ貫太と再会");
Array(#Cg["ev2250千秋オブデス"],"2D","No","ev2250千秋オブデス");
Array(#Cg["ev2300フウリチュー手コキa"],"2D","No","ev2300フウリチュー手コキa","ev2300フウリチュー手コキb","ev2300フウリチュー手コキc","ev2300フウリチュー手コキd");
Array(#Cg["ev2300フウリバックa"],"2D","No","ev2300フウリバックa","ev2300フウリバックb","ev2300フウリバックc","ev2300フウリバックd");
Array(#Cg["ev2300フウリ騎乗位a"],"2D","No","ev2300フウリ騎乗位a","ev2300フウリ騎乗位b","ev2300フウリ騎乗位c","ev2300フウリ騎乗位d","ev2300フウリ騎乗位e");
Array(#Cg["ev0000ノーコカッターa"],"2D","No","ev0000ノーコカッターa","ev0000ノーコカッターb");
Array(#Cg["ev2320カゴメアソビ5"],"2D","No","ev2320カゴメアソビ5");
Array(#Cg["ev2320フウリパイズリフェラa"],"2D","No","ev2320フウリパイズリフェラa","ev2320フウリパイズリフェラb","ev2320フウリパイズリフェラc","ev2320フウリパイズリフェラd");
Array(#Cg["ev2320恵那双六にレイプ未遂a"],"2D","No","ev2320恵那双六にレイプ未遂a","ev2320恵那双六にレイプ未遂b");
Array(#Cg["ev2320沙紅羅千秋と地下鉄チェイスa"],"2D","No","ev2320沙紅羅千秋と地下鉄チェイスa","ev2320沙紅羅千秋と地下鉄チェイスb","ev2320沙紅羅千秋と地下鉄チェイスc");
Array(#Cg["ev2330似鳥お絵かきタイム"],"2D","No","ev2330似鳥お絵かきタイム");
Array(#Cg["ev2330沙紅羅雪夜乃特攻隊"],"2D","No","ev2330沙紅羅雪夜乃特攻隊");
Array(#Cg["ev2340恵那対ジャブル"],"2D","No","ev2340恵那対ジャブル");
Array(#Cg["ev2350双六歌門を人質に取る"],"2D","No","ev2350双六歌門を人質に取る");
Array(#Cg["ev2350ミヅハノメ銃構え"],"2D","No","ev2350ミヅハノメ銃構え");
Array(#Cg["ev2350第一宇宙速度年越しライブ"],"2D","No","ev2350第一宇宙速度年越しライブ");
Array(#Cg["ev2400恵那千秋変わらない日常"],"2D","No","ev2400恵那千秋変わらない日常");
Array(#Cg["ev2400似鳥ノーコ一番大切なもの"],"2D","No","ev2400似鳥ノーコ一番大切なもの");
Array(#Cg["ev2400フウリタイコを叩きます_big"],"2D","Vr","ev2400フウリタイコを叩きます_big");
Array(#Cg["ev2400カゴメアソビ6a_big"],"2D","Vr","ev2400カゴメアソビ6a_big","ev2400カゴメアソビ6b_big");
Array(#Cg["ev9999おめでとう画像"],"2D","No","ev9999おめでとう画像");

Array(#Cg["bg0101100秋葉原_裏通り_通常"],"BG","No","bg0101100秋葉原_裏通り_通常");
Array(#Cg["bg0101111秋葉原_裏通り_通常"],"BG","No","bg0101111秋葉原_裏通り_通常");
Array(#Cg["bg0101200秋葉原_裏通り_閉店"],"BG","No","bg0101200秋葉原_裏通り_閉店");
Array(#Cg["bg0102100秋葉原_ガード下_通常"],"BG","No","bg0102100秋葉原_ガード下_通常");
Array(#Cg["bg0102111秋葉原_ガード下_通常"],"BG","No","bg0102111秋葉原_ガード下_通常");
Array(#Cg["bg0102200秋葉原_ガード下_閉店"],"BG","No","bg0102200秋葉原_ガード下_閉店");
Array(#Cg["bg0102300秋葉原_ガード下_破壊"],"BG","No","bg0102300秋葉原_ガード下_破壊");
Array(#Cg["bg0102400秋葉原_ガード下_雪"],"BG","No","bg0102400秋葉原_ガード下_雪");
Array(#Cg["bg0103100秋葉原_中央通り_通常"],"BG","No","bg0103100秋葉原_中央通り_通常");
Array(#Cg["bg0103111秋葉原_中央通り_通常"],"BG","No","bg0103111秋葉原_中央通り_通常");
Array(#Cg["bg0103200秋葉原_中央通り_閉店"],"BG","No","bg0103200秋葉原_中央通り_閉店");
Array(#Cg["bg0103211秋葉原_中央通り_閉店"],"BG","No","bg0103211秋葉原_中央通り_閉店");
Array(#Cg["bg0104100秋葉原_万世橋_通常"],"BG","No","bg0104100秋葉原_万世橋_通常");
Array(#Cg["bg0104111秋葉原_万世橋_通常"],"BG","No","bg0104111秋葉原_万世橋_通常");
Array(#Cg["bg0104200秋葉原_万世橋_閉店"],"BG","No","bg0104200秋葉原_万世橋_閉店");
Array(#Cg["bg0104300秋葉原_万世橋_雪"],"BG","No","bg0104300秋葉原_万世橋_雪");
//Array(#Cg["bg0105100秋葉原_川凍る_通常"],"BG","No","bg0105100秋葉原_川凍る_通常");
Array(#Cg["bg0106100秋葉原_蔵前橋通り_通常"],"BG","No","bg0106100秋葉原_蔵前橋通り_通常");
Array(#Cg["bg0107100秋葉原_遠景_通常"],"BG","Vr","bg0107100秋葉原_遠景_通常");
Array(#Cg["bg0107111秋葉原_遠景_通常"],"BG","Vr","bg0107111秋葉原_遠景_通常");
Array(#Cg["bg0107200秋葉原_遠景_閉店"],"BG","Vr","bg0107200秋葉原_遠景_閉店");
Array(#Cg["bg0107300秋葉原_遠景_雪"],"BG","Vr","bg0107300秋葉原_遠景_雪");
Array(#Cg["bg0107400秋葉原_遠景_破壊"],"BG","Vr","bg0107400秋葉原_遠景_破壊");
Array(#Cg["bg0108100秋葉原_俯瞰_通常"],"BG","No","bg0108100秋葉原_俯瞰_通常");
Array(#Cg["bg0108200秋葉原_俯瞰_閉店"],"BG","No","bg0108200秋葉原_俯瞰_閉店");
Array(#Cg["bg0108300秋葉原_俯瞰_雪"],"BG","No","bg0108300秋葉原_俯瞰_雪");
Array(#Cg["bg0108400秋葉原_俯瞰_崩壊"],"BG","No","bg0108400秋葉原_俯瞰_崩壊");
Array(#Cg["bg0201100秋葉原駅_正面_通常"],"BG","No","bg0201100秋葉原駅_正面_通常");
Array(#Cg["bg0201111秋葉原駅_正面_通常"],"BG","No","bg0201111秋葉原駅_正面_通常");
Array(#Cg["bg0201112秋葉原駅_正面_通常"],"BG","No","bg0201112秋葉原駅_正面_通常");
Array(#Cg["bg0201200秋葉原駅_正面_閉店"],"BG","No","bg0201200秋葉原駅_正面_閉店");
Array(#Cg["bg0201211秋葉原駅_正面_閉店"],"BG","No","bg0201211秋葉原駅_正面_閉店");
Array(#Cg["bg0201300秋葉原駅_正面_雪"],"BG","No","bg0201300秋葉原駅_正面_雪");
Array(#Cg["bg0301100あにのあな_正面_通常"],"BG","Vr","bg0301100あにのあな_正面_通常");
Array(#Cg["bg0301111あにのあな_正面_通常"],"BG","Vr","bg0301111あにのあな_正面_通常");
Array(#Cg["bg0301200あにのあな_正面_停電"],"BG","Vr","bg0301200あにのあな_正面_停電");
Array(#Cg["bg0301211あにのあな_正面_停電"],"BG","Vr","bg0301211あにのあな_正面_停電");
Array(#Cg["bg0302100あにのあな_店内_通常"],"BG","No","bg0302100あにのあな_店内_通常");
Array(#Cg["bg0302111あにのあな_店内_通常"],"BG","No","bg0302111あにのあな_店内_通常");
Array(#Cg["bg0302200あにのあな_店内_停電"],"BG","No","bg0302200あにのあな_店内_停電");
Array(#Cg["bg0302211あにのあな_店内_停電"],"BG","No","bg0302211あにのあな_店内_停電");
Array(#Cg["bg0303100あにのあな_屋上_通常"],"BG","No","bg0303100あにのあな_屋上_通常");
Array(#Cg["bg0401100アキバスポット_正面_通常"],"BG","No","bg0401100アキバスポット_正面_通常");
Array(#Cg["bg0401200アキバスポット_正面_クリマン崩れ"],"BG","No","bg0401200アキバスポット_正面_クリマン崩れ");
Array(#Cg["bg0401300アキバスポット_正面_修復後"],"BG","No","bg0401300アキバスポット_正面_修復後");
Array(#Cg["bg0401400アキバスポット_正面_車なし"],"BG","No","bg0401400アキバスポット_正面_車なし");
Array(#Cg["bg0501100スーパーノヴァ_正面_通常"],"BG","No","bg0501100スーパーノヴァ_正面_通常");
Array(#Cg["bg0501111スーパーノヴァ_正面_通常"],"BG","No","bg0501111スーパーノヴァ_正面_通常");
Array(#Cg["bg0501200スーパーノヴァ_正面_ガラス割れ"],"BG","No","bg0501200スーパーノヴァ_正面_ガラス割れ");
Array(#Cg["bg0501300スーパーノヴァ_正面_ガラス補修"],"BG","No","bg0501300スーパーノヴァ_正面_ガラス補修");
Array(#Cg["bg0501400スーパーノヴァ_正面_ガラス車イン"],"BG","No","bg0501400スーパーノヴァ_正面_ガラス車イン");
Array(#Cg["bg0501500スーパーノヴァ_正面_ガラス割れタイヤ痕"],"BG","No","bg0501500スーパーノヴァ_正面_ガラス割れタイヤ痕");

Array(#Cg["bg0501600スーパーノヴァ_正面_ガラス補修車イン"],"BG","No","bg0501600スーパーノヴァ_正面_ガラス補修車イン");
Array(#Cg["bg0501700スーパーノヴァ_正面_ガラス補修タイヤ痕"],"BG","No","bg0501700スーパーノヴァ_正面_ガラス補修タイヤ痕");

Array(#Cg["bg0502100スーパーノヴァ_ライブ会場_ガラス割れ"],"BG","No","bg0502100スーパーノヴァ_ライブ会場_ガラス割れ");
Array(#Cg["bg0502100スーパーノヴァ_ライブ会場_通常"],"BG","No","bg0502100スーパーノヴァ_ライブ会場_通常");
Array(#Cg["bg0502111スーパーノヴァ_ライブ会場_ガラス割れ"],"BG","No","bg0502111スーパーノヴァ_ライブ会場_ガラス割れ");
Array(#Cg["bg0502111スーパーノヴァ_ライブ会場_通常"],"BG","No","bg0502111スーパーノヴァ_ライブ会場_通常");
Array(#Cg["bg0502200スーパーノヴァ_ライブ会場_ガラス補修"],"BG","No","bg0502200スーパーノヴァ_ライブ会場_ガラス補修");
Array(#Cg["bg0502200スーパーノヴァ_ライブ会場_消灯"],"BG","No","bg0502200スーパーノヴァ_ライブ会場_消灯");
Array(#Cg["bg0502211スーパーノヴァ_ライブ会場_ガラス補修"],"BG","No","bg0502211スーパーノヴァ_ライブ会場_ガラス補修");
Array(#Cg["bg0502211スーパーノヴァ_ライブ会場_消灯"],"BG","No","bg0502211スーパーノヴァ_ライブ会場_消灯");
Array(#Cg["bg0502300スーパーノヴァ_ライブ会場_ガラス車イン"],"BG","No","bg0502300スーパーノヴァ_ライブ会場_ガラス車イン");
Array(#Cg["bg0502300スーパーノヴァ_ライブ会場_地震後"],"BG","No","bg0502300スーパーノヴァ_ライブ会場_地震後");

Array(#Cg["bg0502400スーパーノヴァ_ライブ会場_ガラス補修車イン"],"BG","No","bg0502400スーパーノヴァ_ライブ会場_ガラス補修車イン");

Array(#Cg["bg0503100スーパーノヴァ_控え室_通常"],"BG","No","bg0503100スーパーノヴァ_控え室_通常");
Array(#Cg["bg0601100半田明神_男坂_通常"],"BG","No","bg0601100半田明神_男坂_通常");
Array(#Cg["bg0601200半田明神_男坂_雪"],"BG","No","bg0601200半田明神_男坂_雪");
Array(#Cg["bg0601211半田明神_男坂_雪"],"BG","No","bg0601211半田明神_男坂_雪");
Array(#Cg["bg0602100半田明神_鳥居_通常"],"BG","No","bg0602100半田明神_鳥居_通常");
Array(#Cg["bg0602111半田明神_鳥居_通常"],"BG","No","bg0602111半田明神_鳥居_通常");
Array(#Cg["bg0602112半田明神_鳥居_通常"],"BG","No","bg0602112半田明神_鳥居_通常");
Array(#Cg["bg0602200半田明神_鳥居_ペンキ"],"BG","No","bg0602200半田明神_鳥居_ペンキ");
Array(#Cg["bg0602211半田明神_鳥居_ペンキ"],"BG","No","bg0602211半田明神_鳥居_ペンキ");
Array(#Cg["bg0602300半田明神_鳥居_雪"],"BG","No","bg0602300半田明神_鳥居_雪");
Array(#Cg["bg0602311半田明神_鳥居_雪"],"BG","No","bg0602311半田明神_鳥居_雪");
Array(#Cg["bg0603100半田明神_境内_通常"],"BG","No","bg0603100半田明神_境内_通常");
Array(#Cg["bg0603111半田明神_境内_通常"],"BG","No","bg0603111半田明神_境内_通常");
Array(#Cg["bg0603200半田明神_境内_ペンキ"],"BG","No","bg0603200半田明神_境内_ペンキ");
Array(#Cg["bg0603300半田明神_境内_雪ライブ"],"BG","No","bg0603300半田明神_境内_雪ライブ");
Array(#Cg["bg0603311半田明神_境内_雪ライブ"],"BG","No","bg0603311半田明神_境内_雪ライブ");
Array(#Cg["bg0603400半田明神_境内_ノーマル新年"],"BG","No","bg0603400半田明神_境内_ノーマル新年");
Array(#Cg["bg0603411半田明神_境内_ノーマル新年"],"BG","No","bg0603411半田明神_境内_ノーマル新年");
Array(#Cg["bg0603500半田明神_境内_雪ノーマル新年"],"BG","No","bg0603500半田明神_境内_雪ノーマル新年");
Array(#Cg["bg0603511半田明神_境内_雪ノーマル新年"],"BG","No","bg0603511半田明神_境内_雪ノーマル新年");
Array(#Cg["bg0603600半田明神_境内_雪トゥルー新年"],"BG","No","bg0603600半田明神_境内_雪トゥルー新年");
Array(#Cg["bg0603611半田明神_境内_雪トゥルー新年"],"BG","No","bg0603611半田明神_境内_雪トゥルー新年");
Array(#Cg["bg0603700半田明神_境内_厭覇薔薇新年"],"BG","No","bg0603700半田明神_境内_厭覇薔薇新年");
Array(#Cg["bg0603711半田明神_境内_厭覇薔薇新年"],"BG","No","bg0603711半田明神_境内_厭覇薔薇新年");
Array(#Cg["bg0603800半田明神_境内_雪ノーマル新年新カンダー"],"BG","No","bg0603800半田明神_境内_雪ノーマル新年新カンダー");
Array(#Cg["bg0603811半田明神_境内_雪ノーマル新年新カンダー"],"BG","No","bg0603811半田明神_境内_雪ノーマル新年新カンダー");
Array(#Cg["bg0603900半田明神_境内_厭覇薔薇新年新カンダー"],"BG","No","bg0603900半田明神_境内_厭覇薔薇新年新カンダー");
Array(#Cg["bg0603911半田明神_境内_厭覇薔薇新年新カンダー"],"BG","No","bg0603911半田明神_境内_厭覇薔薇新年新カンダー");
Array(#Cg["bg0604100半田明神_社務所_通常"],"BG","No","bg0604100半田明神_社務所_通常");
Array(#Cg["bg0604111半田明神_社務所_通常"],"BG","No","bg0604111半田明神_社務所_通常");
Array(#Cg["bg0604112半田明神_社務所_通常"],"BG","No","bg0604112半田明神_社務所_通常");
Array(#Cg["bg0604200半田明神_社務所_雪"],"BG","No","bg0604200半田明神_社務所_雪");
Array(#Cg["bg0604211半田明神_社務所_雪"],"BG","No","bg0604211半田明神_社務所_雪");
Array(#Cg["bg0604212半田明神_社務所_雪"],"BG","No","bg0604212半田明神_社務所_雪");
Array(#Cg["bg0605100半田明神_屋根_通常"],"BG","No","bg0605100半田明神_屋根_通常");
Array(#Cg["bg0605200半田明神_屋根_ペンキ"],"BG","No","bg0605200半田明神_屋根_ペンキ");
Array(#Cg["bg0605300半田明神_屋根_雪"],"BG","No","bg0605300半田明神_屋根_雪");
Array(#Cg["bg0606100半田明神_涸れ井戸_通常"],"BG","No","bg0606100半田明神_涸れ井戸_通常");
Array(#Cg["bg0606200半田明神_涸れ井戸_雪"],"BG","No","bg0606200半田明神_涸れ井戸_雪");
Array(#Cg["bg0607100半田明神_拝殿_通常"],"BG","No","bg0607100半田明神_拝殿_通常");
Array(#Cg["bg0607200半田明神_拝殿_ソトカンダー"],"BG","No","bg0607200半田明神_拝殿_ソトカンダー");
Array(#Cg["bg0607300半田明神_拝殿_布地"],"BG","No","bg0607300半田明神_拝殿_布地");
Array(#Cg["bg0701100地下_通路_通常"],"BG","No","bg0701100地下_通路_通常");
Array(#Cg["bg0701200地下_通路_地震後"],"BG","No","bg0701200地下_通路_地震後");
Array(#Cg["bg0701300地下_通路_水"],"BG","No","bg0701300地下_通路_水");
Array(#Cg["bg0701400地下_通路_あにのあな"],"BG","No","bg0701400地下_通路_あにのあな");
Array(#Cg["bg0701500地下_通路_スパコン館"],"BG","No","bg0701500地下_通路_スパコン館");
Array(#Cg["bg0701600地下_通路_バックギャモン"],"BG","No","bg0701600地下_通路_バックギャモン");
Array(#Cg["bg0702100地下_祭壇_通常"],"BG","No","bg0702100地下_祭壇_通常");
Array(#Cg["bg0702200地下_祭壇_閉門"],"BG","No","bg0702200地下_祭壇_閉門");
Array(#Cg["bg0703100地下_地下鉄_通常"],"BG","No","bg0703100地下_地下鉄_通常");
Array(#Cg["bg0801100籠_正面_通常"],"BG","No","bg0801100籠_正面_通常");
Array(#Cg["bg0801200籠_正面_ブラックライト"],"BG","No","bg0801200籠_正面_ブラックライト");
Array(#Cg["bg0801300籠_正面_激流"],"BG","No","bg0801300籠_正面_激流");
Array(#Cg["bg0802100籠_内部_通常"],"BG","No","bg0802100籠_内部_通常");
Array(#Cg["bg0901100エレキセンター_廊下_通常"],"BG","No","bg0901100エレキセンター_廊下_通常");
Array(#Cg["bg0901200エレキセンター_廊下_閉店"],"BG","No","bg0901200エレキセンター_廊下_閉店");
Array(#Cg["bg0902100エレキセンター_ジャガンナート_通常"],"BG","No","bg0902100エレキセンター_ジャガンナート_通常");
Array(#Cg["bg1001100バックギャモン_正面_通常"],"BG","No","bg1001100バックギャモン_正面_通常");
Array(#Cg["bg1002100バックギャモン_店内_通常"],"BG","No","bg1002100バックギャモン_店内_通常");
Array(#Cg["bg1101100スパコン館_裏面_通常"],"BG","No","bg1101100スパコン館_裏面_通常");
Array(#Cg["bg1101111スパコン館_裏面_通常"],"BG","No","bg1101111スパコン館_裏面_通常");
Array(#Cg["bg1101200スパコン館_裏面_閉店"],"BG","No","bg1101200スパコン館_裏面_閉店");
Array(#Cg["bg1101300スパコン館_裏面_電柱折れ"],"BG","No","bg1101300スパコン館_裏面_電柱折れ");
Array(#Cg["bg1101400スパコン館_裏面_半廃墟"],"BG","No","bg1101400スパコン館_裏面_半廃墟");
Array(#Cg["bg1101500スパコン館_裏面_廃墟"],"BG","No","bg1101500スパコン館_裏面_廃墟");
Array(#Cg["bg1102100スパコン館_通路_通常"],"BG","No","bg1102100スパコン館_通路_通常");
Array(#Cg["bg1102200スパコン館_通路_半崩壊"],"BG","No","bg1102200スパコン館_通路_半崩壊");
Array(#Cg["bg1103100スパコン館_店内_通常"],"BG","No","bg1103100スパコン館_店内_通常");
Array(#Cg["bg1103200スパコン館_店内_半崩壊"],"BG","No","bg1103200スパコン館_店内_半崩壊");
Array(#Cg["bg1104100スパコン館_スタジオ_通常"],"BG","No","bg1104100スパコン館_スタジオ_通常");
Array(#Cg["bg1201100ＵＰ＋_屋外セット_通常"],"BG","No","bg1201100ＵＰ＋_屋外セット_通常");
Array(#Cg["bg1201111ＵＰ＋_屋外セット_通常"],"BG","No","bg1201111ＵＰ＋_屋外セット_通常");
Array(#Cg["bg1201200ＵＰ＋_屋外セット_炎上"],"BG","No","bg1201200ＵＰ＋_屋外セット_炎上");
Array(#Cg["bg1201211ＵＰ＋_屋外セット_炎上"],"BG","No","bg1201211ＵＰ＋_屋外セット_炎上");
Array(#Cg["bg1201300ＵＰ＋_屋外セット_暗闇"],"BG","No","bg1201300ＵＰ＋_屋外セット_暗闇");
Array(#Cg["bg1201311ＵＰ＋_屋外セット_暗闇"],"BG","No","bg1201311ＵＰ＋_屋外セット_暗闇");
Array(#Cg["bg1202100ＵＰ＋_セット上_通常"],"BG","No","bg1202100ＵＰ＋_セット上_通常");
Array(#Cg["bg1202200ＵＰ＋_セット上_暗闇"],"BG","No","bg1202200ＵＰ＋_セット上_暗闇");
Array(#Cg["bg1202300ＵＰ＋_セット上_炎上"],"BG","No","bg1202300ＵＰ＋_セット上_炎上");
Array(#Cg["bg1203100ＵＰ＋_セット裏_通常"],"BG","No","bg1203100ＵＰ＋_セット裏_通常");
Array(#Cg["bg1203200ＵＰ＋_セット裏_暗闇"],"BG","No","bg1203200ＵＰ＋_セット裏_暗闇");
Array(#Cg["bg1301100似鳥マンション_エントランス_通常"],"BG","No","bg1301100似鳥マンション_エントランス_通常");
Array(#Cg["bg1302100似鳥マンション_正面_通常"],"BG","No","bg1302100似鳥マンション_正面_通常");
Array(#Cg["bg1302200似鳥マンション_正面_亀裂"],"BG","No","bg1302200似鳥マンション_正面_亀裂");
Array(#Cg["bg1302300似鳥マンション_正面_亀裂補修"],"BG","No","bg1302300似鳥マンション_正面_亀裂補修");
Array(#Cg["bg1303100似鳥マンション_玄関_通常"],"BG","No","bg1303100似鳥マンション_玄関_通常");
Array(#Cg["bg1303200似鳥マンション_玄関_カレー"],"BG","No","bg1303200似鳥マンション_玄関_カレー");
Array(#Cg["bg1304100似鳥マンション_リビング_通常"],"BG","No","bg1304100似鳥マンション_リビング_通常");
Array(#Cg["bg1304200似鳥マンション_リビング_同人誌散乱"],"BG","No","bg1304200似鳥マンション_リビング_同人誌散乱");
Array(#Cg["bg1304300似鳥マンション_リビング_掃除後"],"BG","No","bg1304300似鳥マンション_リビング_掃除後");
Array(#Cg["bg1401100泰然堂大学病院_正面_通常"],"BG","No","bg1401100泰然堂大学病院_正面_通常");
Array(#Cg["bg1402100泰然堂大学病院_病室_通常"],"BG","No","bg1402100泰然堂大学病院_病室_通常");
Array(#Cg["bg1403100泰然堂大学病院_廊下_通常"],"BG","No","bg1403100泰然堂大学病院_廊下_通常");
Array(#Cg["bg1404100泰然堂大学病院_霊安室_通常"],"BG","No","bg1404100泰然堂大学病院_霊安室_通常");
Array(#Cg["bg1501100柳神社_境内_通常"],"BG","No","bg1501100柳神社_境内_通常");
Array(#Cg["bg1501200柳神社_境内_雪"],"BG","No","bg1501200柳神社_境内_雪");
Array(#Cg["bg1502100柳神社_お墓_通常"],"BG","No","bg1502100柳神社_お墓_通常");
Array(#Cg["bg1502200柳神社_お墓_雪"],"BG","No","bg1502200柳神社_お墓_雪");
Array(#Cg["bg1601100小碓家_正面_通常"],"BG","No","bg1601100小碓家_正面_通常");
Array(#Cg["bg1601100小碓家_自室_通常"],"BG","No","bg1601100小碓家_自室_通常");
Array(#Cg["bg1602100小碓家_自室過去_通常"],"BG","No","bg1602100小碓家_自室過去_通常");
Array(#Cg["bg1701100銭形公園_全景_通常"],"BG","No","bg1701100銭形公園_全景_通常");
Array(#Cg["bg1701200銭形公園_全景_夕"],"BG","No","bg1701200銭形公園_全景_夕");
Array(#Cg["bg1702100銭形公園_トイレ正面_通常"],"BG","No","bg1702100銭形公園_トイレ正面_通常");
Array(#Cg["bg1703100銭形公園_トイレ中_通常"],"BG","No","bg1703100銭形公園_トイレ中_通常");
Array(#Cg["bg1703200銭形公園_トイレ中_奧閉まる"],"BG","No","bg1703200銭形公園_トイレ中_奧閉まる");
Array(#Cg["bg1703300銭形公園_トイレ中_破壊"],"BG","No","bg1703300銭形公園_トイレ中_破壊");
Array(#Cg["bg1704100銭形公園_トイレ個室_通常"],"BG","No","bg1704100銭形公園_トイレ個室_通常");
Array(#Cg["bg1704200銭形公園_トイレ個室_水没"],"BG","No","bg1704200銭形公園_トイレ個室_水没");
Array(#Cg["bg1801100ドンガ・バチョ_家電売り場_通常"],"BG","No","bg1801100ドンガ・バチョ_家電売り場_通常");
Array(#Cg["bg1801111ドンガ・バチョ_家電売り場_通常"],"BG","No","bg1801111ドンガ・バチョ_家電売り場_通常");
Array(#Cg["bg1901100ショウビル_正面_通常"],"BG","No","bg1901100ショウビル_正面_通常");
Array(#Cg["bg1901111ショウビル_正面_通常"],"BG","No","bg1901111ショウビル_正面_通常");
Array(#Cg["bg2001100ビッグサイト_正面_通常"],"BG","No","bg2001100ビッグサイト_正面_通常");
Array(#Cg["bg2001111ビッグサイト_正面_通常"],"BG","No","bg2001111ビッグサイト_正面_通常");
Array(#Cg["bg2101100プリーズ_店内_通常"],"BG","No","bg2101100プリーズ_店内_通常");
Array(#Cg["bg2201100屋島_古戦場_通常"],"BG","No","bg2201100屋島_古戦場_通常");
Array(#Cg["bg2301100パチンコ屋_正面_通常"],"BG","No","bg2301100パチンコ屋_正面_通常");
Array(#Cg["bg2301111パチンコ屋_正面_通常"],"BG","No","bg2301111パチンコ屋_正面_通常");
Array(#Cg["bg2302100パチンコ屋_店内_通常"],"BG","No","bg2302100パチンコ屋_店内_通常");
Array(#Cg["bg2302111パチンコ屋_店内_通常"],"BG","No","bg2302111パチンコ屋_店内_通常");
Array(#Cg["bg2401100空_上空_通常"],"BG","No","bg2401100空_上空_通常");
Array(#Cg["bg2501100信号機_見上げ_青"],"BG","No","bg2501100信号機_見上げ_青");
Array(#Cg["bg2501200信号機_見上げ_黄"],"BG","No","bg2501200信号機_見上げ_黄");
Array(#Cg["bg2501300信号機_見上げ_赤"],"BG","No","bg2501300信号機_見上げ_赤");
Array(#Cg["bg2502100信号機_見上げ_青標識無"],"BG","No","bg2502100信号機_見上げ_青標識無");
Array(#Cg["bg2502200信号機_見上げ_黄標識無"],"BG","No","bg2502200信号機_見上げ_黄標識無");
Array(#Cg["bg2502300信号機_見上げ_赤標識無"],"BG","No","bg2502300信号機_見上げ_赤標識無");
Array(#Cg["bg2601100電柱_見上げ_通常"],"BG","No","bg2601100電柱_見上げ_通常");

//Array(#Cg["img金閣寺_煽り"],"3D","No","img金閣寺_煽り");
Array(#Cg["img金閣寺イメージ絵"],"3D","No","img金閣寺イメージ絵");
Array(#Cg["img金閣寺水面に揺れる"],"3D","No","img金閣寺水面に揺れる");
Array(#Cg["imgタヌキの携帯ストラップ"],"3D","No","imgタヌキの携帯ストラップ");
Array(#Cg["imgノーコントロール01"],"3D","No","imgノーコントロール01");
Array(#Cg["imgノーコントロール10"],"3D","No","imgノーコントロール10");
Array(#Cg["imgノーコントロール11"],"3D","No","imgノーコントロール11");
Array(#Cg["imgノーコントロール11中身"],"3D","No","imgノーコントロール11中身");
Array(#Cg["imgスマガＤＳ"],"3D","No","imgスマガＤＳ");
Array(#Cg["imgフウリの手紙"],"3D","No","imgフウリの手紙");
Array(#Cg["imgエコバッグ_沙紅羅2350"],"3D","No","imgエコバッグ_沙紅羅2350");
Array(#Cg["img引き裂かれた同人誌が夜空に舞う"],"3D","No","img引き裂かれた同人誌が夜空に舞う");
Array(#Cg["img引き裂かれた同人誌が地面に散らばる"],"3D","No","img引き裂かれた同人誌が地面に散らばる");
Array(#Cg["imgイタバイク駐車"],"3D","No","imgイタバイク駐車");
Array(#Cg["imgカッター全体"],"3D","No","imgカッター全体");
Array(#Cg["imgカッター刃元a"],"3D","No","imgカッター刃元a");
Array(#Cg["imgカッター刃元b"],"3D","No","imgカッター刃元b");
Array(#Cg["imgソトカンダーイラスト"],"3D","No","imgソトカンダーイラスト");
Array(#Cg["imgソトカンダー真イラスト"],"3D","No","imgソトカンダー真イラスト");
Array(#Cg["imgソトカンダー真イラスト_big"],"3D","No","imgソトカンダー真イラスト_big");
Array(#Cg["imgソトカンダー落下"],"3D","No","imgソトカンダー落下");
Array(#Cg["img路肩"],"3D","No","img路肩");
Array(#Cg["imgエコバッグ_千秋1820"],"3D","No","imgエコバッグ_千秋1820");
Array(#Cg["img縞パン"],"3D","No","img縞パン");
Array(#Cg["imgネットトレードＰＣ画面"],"3D","No","imgネットトレードＰＣ画面");
Array(#Cg["imgスカイプシーンa"],"3D","No","imgスカイプシーンa");
Array(#Cg["imgスカイプシーンb"],"3D","No","imgスカイプシーンb");
Array(#Cg["img地下通路の矢印"],"3D","No","img地下通路の矢印");
Array(#Cg["img双六死に手"],"3D","No","img双六死に手");
Array(#Cg["imgノーコリスカ実体a"],"3D","No","imgノーコリスカ実体a");
Array(#Cg["imgノーコリスカ実体b"],"3D","No","imgノーコリスカ実体b");
Array(#Cg["imgノーコリスカ実体c"],"3D","No","imgノーコリスカ実体c");
Array(#Cg["imgノーコリスカ実体d"],"3D","No","imgノーコリスカ実体d");
Array(#Cg["imgノーコリスカイメージa"],"3D","No","imgノーコリスカイメージa");
Array(#Cg["imgノーコリスカイメージb"],"3D","No","imgノーコリスカイメージb");
Array(#Cg["img戦後の秋葉原"],"3D","No","img戦後の秋葉原");
Array(#Cg["imgアザナエルb"],"3D","No","imgアザナエルb");
Array(#Cg["imgアザナエル"],"3D","No","imgアザナエル");
Array(#Cg["img河原屋双一"],"3D","No","img河原屋双一");
Array(#Cg["imgクリマン断面図"],"3D","No","imgクリマン断面図");
Array(#Cg["img迫り来る村崎のトラック"],"3D","No","img迫り来る村崎のトラック");
Array(#Cg["img平次双六に足を折られる"],"3D","No","img平次双六に足を折られる");
Array(#Cg["imgアザナエルマズル弾なし"],"3D","No","imgアザナエルマズル弾なし");
Array(#Cg["imgノーコントロール車の荷台から溢れる"],"3D","No","imgノーコントロール車の荷台から溢れる");
Array(#Cg["img古銭飛来"],"3D","No","img古銭飛来");
Array(#Cg["img2chシーン似鳥2330"],"3D","No","img2chシーン似鳥2330");
Array(#Cg["img沙紅羅双六の腕をへし折る"],"3D","No","img沙紅羅双六の腕をへし折る");
Array(#Cg["imgミリＰ車"],"3D","No","imgミリＰ車");
Array(#Cg["imgミリＰ車飛翔"],"3D","No","imgミリＰ車飛翔");
Array(#Cg["img花火"],"3D","Vr","img花火");
Array(#Cg["obj肉まん"],"3D","No","obj肉まん");
Array(#Cg["obj千秋ネームプレートa"],"3D","No","obj千秋ネームプレートa");
Array(#Cg["obj千秋ネームプレートb"],"3D","No","obj千秋ネームプレートb");
Array(#Cg["obj御札"],"3D","No","obj御札");
Array(#Cg["objエコバッグ"],"3D","No","objエコバッグ");
Array(#Cg["objエコバッグ_ノーコ2030a"],"3D","No","objエコバッグ_ノーコ2030a");
Array(#Cg["objエコバッグ_ノーコ2030b"],"3D","No","objエコバッグ_ノーコ2030b");
Array(#Cg["objエコバッグ_恵那1900"],"3D","No","objエコバッグ_恵那1900");
Array(#Cg["objエコバッグ_恵那1910"],"3D","No","objエコバッグ_恵那1910");
Array(#Cg["objエコバッグ_千秋_フウリ18"],"3D","No","objエコバッグ_千秋_フウリ18");
Array(#Cg["objヘルメットa"],"3D","No","objヘルメットa");
Array(#Cg["objヘルメットb"],"3D","No","objヘルメットb");
Array(#Cg["objノーカロリーコンニャク"],"3D","No","objノーカロリーコンニャク");
Array(#Cg["objクリマン"],"3D","No","objクリマン");
Array(#Cg["objノートＰＣ"],"3D","No","objノートＰＣ");
Array(#Cg["objタヌキ小走り"],"3D","No","objタヌキ小走り");
Array(#Cg["objタヌキ小走り_横長"],"3D","No","objタヌキ小走り_横長");
Array(#Cg["objソトカンダー落下演出"],"3D","No","objソトカンダー落下演出");
Array(#Cg["objフウリ葉っぱの手紙変化前"],"3D","No","objフウリ葉っぱの手紙変化前");
Array(#Cg["objフウリ葉っぱの手紙変化後"],"3D","No","objフウリ葉っぱの手紙変化後");
Array(#Cg["obj恵那携帯ストラップ"],"3D","No","obj恵那携帯ストラップ");
Array(#Cg["obj千秋携帯ストラップ"],"3D","No","obj千秋携帯ストラップ");
Array(#Cg["obj平次の頭"],"3D","No","obj平次の頭");
Array(#Cg["objロクロー名刺"],"3D","No","objロクロー名刺");
Array(#Cg["objアザナエル弾丸"],"3D","No","objアザナエル弾丸");
Array(#Cg["obj太三郎の葉っぱ"],"3D","No","obj太三郎の葉っぱ");



	#Cg要素数=2;

	$CgWhile=1;
	while(#CgCount>$CgWhile){
		if(!$format){
			//■デバッグモード用
			if($DebugMode){
				CgDebug();
			}
			//■カテゴリ分類
			$CgOpenWhile=0;
			while(Count(#CgCategory)>$CgOpenWhile){
				if(Strstr(#Cg[$CgWhile][0], #CgCategory[$CgOpenWhile])){
					//該当ページは何番まで？
					#CgCategory[$CgOpenWhile][0]=#CgCategory[$CgOpenWhile][0]+1;
					//カテゴリに当てはめていくよ！
					#CgCategory[$CgOpenWhile][#CgCategory[$CgOpenWhile][0]]=#Cg[$CgWhile];
		
					//ＣＧ枚数カウント
					CgRound();
				}
				$CgOpenWhile++;
			}
		}else{
			CgFormat();
		}
		$CgWhile++;
	}
}

...//■フォーマット用
function CgFormat()
{
	$CgOpenWhile=#Cg要素数;
	while(Count(#Cg[$CgWhile])>$CgOpenWhile){
		VariableValue(#,#Cg[$CgWhile][$CgOpenWhile],false);
		$CgOpenWhile++;
	}
}
...//■デバッグ用
function CgDebug()
{
	$CgOpenWhile=#Cg要素数;
	while(Count(#Cg[$CgWhile])>$CgOpenWhile){
		VariableValue(#,#Cg[$CgWhile][$CgOpenWhile],true);
		$CgOpenWhile++;
	}
}
...//□ＣＧ枚数カウント用
function CgRound()
{
	//カテゴリ別総CG数
	#CgCount[$CgOpenWhile]=#CgCount[$CgOpenWhile]+Count(#Cg[$CgWhile])-#Cg要素数;
	//カテゴリ別総有効CG数
	$CgCountWhile=#Cg要素数;
	while(Count(#Cg[$CgWhile])>$CgCountWhile){
		if(VariableValue(#,#Cg[$CgWhile][$CgCountWhile])){
			#CgOnCount[$CgOpenWhile]=#CgOnCount[$CgOpenWhile]+1;
		}
		$CgCountWhile++;
	}
}
...//□ＣＧ枚数書き出し用
function CgWrite()
{
	$CgCountAll=0;
	$CgOnCountAll=0;

	$xxx=0;
	$CgWhile=0;
	while(Count(#CgCategory)>$CgWhile){
		$CgCountAll=$CgCountAll+#CgCount[$CgWhile];
		$CgOnCountAll=$CgOnCountAll+#CgOnCount[$CgWhile];

		if($CgWrite){
			$img=#CgCategory[$CgWhile]+"　"+#CgOnCount[$CgWhile]+"/"+#CgCount[$CgWhile];
			$nut="CgText"+$CgWhile;
			$xxx+=30;
			SetFont("ＭＳ 明朝", 18, 000000, FFFFFF, MEDIUM, RIGHTDOWN);
			CreateText($nut, 9999, 0, $xxx, Auto, Auto, $img);
		}
		$CgWhile++;
	}

	if($CgWrite){
		$img="全体　"+$CgOnCountAll+"/"+$CgCountAll;
		CreateText("CgText9", 9999, 0, 0, Auto, Auto, $img);
	}

	//コングラ判定専用
	$Hantei=$CgCountAll-$CgOnCountAll;

	if($Hantei==1){
		$CompleteCount=true;
	}
}


..//●選択肢生成と描画
function Gallery()
{
	if($CgFirst){
	}else{
		CreateTexture("CgScreen", 10000, 0, 0, SCREEN);
		Fade("CgNext/MouseUsual/img", 0, 1000, null, false);
		Fade("CgBack/MouseUsual/img", 0, 1000, null, false);
	}

	//■選択肢定義
	$CgMaxCount=20;//カテゴリのページ数
	$PreX=722;
	$PreY=77;
	$X_plus=-190;
	$Y_plus=92;
	$Gyou1=5;
	$Gyou2=10;
	$Gyou3=15;
	$Gyou4=20;
	$Gyou5=25;
	$X=$PreX;
	$Y=$PreY;
	//カテゴリにおける最大ページ数
	$CgMaxPage=Integer(#CgCategory[$CgPhase][0]/$CgMaxCount);
	if((#CgCategory[$CgPhase][0]%$CgMaxCount)>0){
		$CgMaxPage+=1;
		$CgOverPage=$CgMaxPage+1;
	}

	$CgWhile=1;//選択番号
	$CgWhile2=(($CgPage-1)*$CgMaxCount)+1;//ほんとの番号
	while($CgMaxCount>=$CgWhile){
		//▼サムネイル選抜と有効枚数カウント用
		VariableValue($,"CgCheck"+$CgWhile,false);
		$CgBunsi=0;
		$CgBunbo=0;
		$onimg="false";
		$CountWhile=#Cg要素数;
		while(Count(#Cg[#CgCategory[$CgPhase][$CgWhile2]])>$CountWhile){
			$CgBunbo++;
			if(VariableValue(#,#Cg[#CgCategory[$CgPhase][$CgWhile2]][$CountWhile])&&$CgWhile2<=#CgCategory[$CgPhase][0]){
				if(!$onimg){
					$nutimg=#Cg[#CgCategory[$CgPhase][$CgWhile2]][$CountWhile];
					VariableValue($,"CgCheck"+$CgWhile,true);
				}
				$CgBunsi++;
				$onimg=true;
			}
			$CountWhile++;
		}

		//▼選択肢生成開始
		$nutbase="Cg"+$CgWhile;
		$nut=$nutbase+"/img";
		Delete($nut);
		if($CgFirst){
			CreateChoice($nutbase);
			SetAlias($nutbase, $nutbase);
			$nut=$nutbase+"/MouseUsual/hit";
			CreateTexture($nut, 1001, $X, $Y, "CgImage0");
			Request($nut, Erase);
			$nut=$nutbase+"/MouseOver/img";
			CreateTexture($nut, 1001, $X, $Y, "CgImage2");
			//$nut=$nutbase+"/MouseClick/img";
			//CreateTexture($nut, 1001, $X, $Y, "CgImage3");
			$nut=$nutbase+"/MouseClick";
			Delete($nut);
		}

		if($onimg){
			//文字列判定
			if(Strstr($nutimg, "ev")){
				$index="ev";
			}else if(Strstr($nutimg, "img")){
				$index="img";
			}else if(Strstr($nutimg, "obj")){
				$index="obj";
			}else{
				$index="bg";
			}
			$img="cg/sys/extra/thum/"+$index+"/"+$nutimg+".jpg";
		}else{
			$CgBunsi=1;
			$CgBunbo=1;
			$img="CgImage1";
		}
		$nut=$nutbase+"/img";
		CreateTexture($nut, 1000, $X, $Y, $img);
		if(($CgBunsi/$CgBunbo)!=1){
			Fade($nut, 0, 500, null, true);
		}

		if($CgWhile2>#CgCategory[$CgPhase][0]){
			Request($nutbase,UnClickable);
			$nut=$nutbase+"/*/*";
			Request($nut, Erase);
			$nut=$nutbase+"/*";
			Request($nut, Erase);
		}else if(!$onimg){
			Request($nutbase,UnClickable);
			$nut=$nutbase+"/*/*";
			Request($nut, Erase);
		}else{
			Request($nutbase,Clickable);
			$nut=$nutbase+"/*/*";
			Request($nut, Enter);
			$nut=$nutbase+"/MouseUsual/*";
			Request($nut, Erase);
			$nut=$nutbase+"/*";
			Request($nut, Enter);
		}

		$CgWhile2++;
		$CgWhile++;

		//データ移動
		if($CgWhile<=$Gyou1){
			$Y=$PreY+($Y_plus*($CgWhile-1));
		}else if($CgWhile<=$Gyou2){
			$Y=$PreY+($Y_plus*($CgWhile-$Gyou1-1));
			$X=$PreX+$X_plus;
		}else if($CgWhile<=$Gyou3){
			$Y=$PreY+($Y_plus*($CgWhile-$Gyou2-1));
			$X=$PreX+($X_plus*2)-1;//画像バグ1px
		}else if($CgWhile<=$Gyou4){
			$Y=$PreY+($Y_plus*($CgWhile-$Gyou3-1));
			$X=$PreX+($X_plus*3)-1;//画像バグ1px
		}else if($CgWhile<=$Gyou5){
			$Y=$PreY+($Y_plus*($CgWhile-$Gyou4-1));
			$X=$PreX+($X_plus*4);
		}
	}

	Fade("*/MouseOver/*", 0, 0, null, false);
	Fade("*/MouseClick/*", 0, 0, null, true);

	//●セットネクストフォーカス
	Array($CgForcus,"0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","2D","3D","BG","Exit","P1","P2","P3","P4","P5","P6","P7","P8","P9","P10");
	AssocArray($CgForcus,"0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","2D","3D","BG","Exit","P1","P2","P3","P4","P5","P6","P7","P8","P9","P10");

	//ページ番号数による違い
	Array($CgForcus[1][$CgPhase],"3D",2,6,P1);
	Array($CgForcus[2][$CgPhase],1,3,7,P3);

	Array($CgForcus[6][$CgPhase],"BG",7,11,1);
	Array($CgForcus[7][$CgPhase],6,8,12,2);
	Array($CgForcus[8][$CgPhase],7,9,13,3);
	Array($CgForcus[9][$CgPhase],8,10,14,4);
	Array($CgForcus[10][$CgPhase],9,"BG",15,5);
	Array($CgForcus[11][$CgPhase],"BG",12,16,6);
	Array($CgForcus[12][$CgPhase],11,13,17,7);
	Array($CgForcus[13][$CgPhase],12,14,18,8);
	Array($CgForcus[14][$CgPhase],13,15,19,9);
	Array($CgForcus[15][$CgPhase],14,"BG",20,10);
	Array($CgForcus[16][$CgPhase],"2D",17,P1,11);
	Array($CgForcus[17][$CgPhase],16,18,P3,12);

	Array($CgForcus[P2][$CgPhase],P1,P3,1,16);
	Array($CgForcus[P3][$CgPhase],P2,P4,2,17);

	Array($CgForcus[P5][$CgPhase],P4,P6,3,18);
	Array($CgForcus[P6][$CgPhase],P5,P7,3,18);
	Array($CgForcus[P7][$CgPhase],P6,P8,4,19);
	Array($CgForcus[P8][$CgPhase],P7,P9,4,19);

	Array($CgForcus["2D"][$CgPhase],20,16,"3D","BG");
	Array($CgForcus["3D"][$CgPhase],5,1,"BG","2D");
	Array($CgForcus["BG"][$CgPhase],10,11,"2D","3D");
	//Array($CgForcus[Next][$CgPhase],BG,"2D",5,Back);
	//Array($CgForcus[Back][$CgPhase],BG,"2D",Next,Exit);

	if($CgPhase==0){
		//2D
		Array($CgForcus[3][$CgPhase],2,4,8,18);
		Array($CgForcus[4][$CgPhase],3,5,9,19);
		Array($CgForcus[5][$CgPhase],4,"3D",10,Exit);
		Array($CgForcus[18][$CgPhase],17,19,3,13);
		Array($CgForcus[19][$CgPhase],18,20,4,14);
		Array($CgForcus[20][$CgPhase],19,"2D",Exit,15);

		Array($CgForcus[P1][$CgPhase],P4,P2,1,16);
		Array($CgForcus[P4][$CgPhase],P3,P1,2,17);
		Array($CgForcus[P9][$CgPhase],P8,P1,4,19);
		Array($CgForcus[P10][$CgPhase],P9,P1,Exit,20);
		Array($CgForcus[Exit][$CgPhase],"3D","3D",5,20);
	}else if($CgPhase==1){
		//3D
		Array($CgForcus[3][$CgPhase],2,4,8,18);
		Array($CgForcus[4][$CgPhase],3,5,9,19);
		Array($CgForcus[5][$CgPhase],4,"3D",10,Exit);
		Array($CgForcus[18][$CgPhase],17,19,3,13);
		Array($CgForcus[19][$CgPhase],18,20,4,14);
		Array($CgForcus[20][$CgPhase],19,"2D",Exit,15);

		Array($CgForcus[P1][$CgPhase],P4,P2,1,16);
		Array($CgForcus[P4][$CgPhase],P3,P1,2,17);
		Array($CgForcus[P9][$CgPhase],P8,P1,4,19);
		Array($CgForcus[P10][$CgPhase],P9,P1,Exit,20);
		Array($CgForcus[Exit][$CgPhase],"3D","3D",5,20);
	}else if($CgPhase==2){
		//背景
		Array($CgForcus[3][$CgPhase],2,4,8,P5);
		Array($CgForcus[4][$CgPhase],3,5,9,P8);
		Array($CgForcus[5][$CgPhase],4,"3D",10,Exit);
		Array($CgForcus[18][$CgPhase],17,19,P5,13);
		Array($CgForcus[19][$CgPhase],18,20,P8,14);
		Array($CgForcus[20][$CgPhase],19,"2D",P10,15);
	
		Array($CgForcus[P1][$CgPhase],P10,P2,1,16);
		Array($CgForcus[P4][$CgPhase],P3,P5,2,17);
		Array($CgForcus[P9][$CgPhase],P8,P10,4,19);
		Array($CgForcus[P10][$CgPhase],P9,P1,Exit,20);
		Array($CgForcus[Exit][$CgPhase],"3D","3D",5,P10);
	}

	$CgWhile=1;
	while(Count($CgForcus)>$CgWhile){
		$basenut="Cg"+$CgForcus[$CgWhile]+"/MouseUsual/hit";
		$up="Cg"+$CgForcus[$CgWhile][$CgPhase][0]+"/MouseUsual/hit";
		$down="Cg"+$CgForcus[$CgWhile][$CgPhase][1]+"/MouseUsual/hit";
		$left="Cg"+$CgForcus[$CgWhile][$CgPhase][2]+"/MouseUsual/hit";
		$right="Cg"+$CgForcus[$CgWhile][$CgPhase][3]+"/MouseUsual/hit";
		SetNextFocus($basenut, $up, UP);
		SetNextFocus($basenut, $down, DOWN);
		SetNextFocus($basenut, $left, LEFT);
		SetNextFocus($basenut, $right, RIGHT);
		$CgWhile++;
	}

	//●描画
	//カテゴリー
	$CgWhile=0;
	while(Count(#CgCategory)>$CgWhile){
		$CgNutBase="Cg"+#CgCategory[$CgWhile];
		$nut=$CgNutBase+"/img2";
		Fade($nut, 0, 0, null, true);
		Request($CgNutBase, Clickable);
		$nut=$CgNutBase+"/MouseOver/nut";
		Request($nut, Enter);
		$nut=$CgNutBase+"/MouseClick/nut";
		Request($nut, Enter);
		$CgWhile++;
	}
	$CgNutBase="Cg"+#CgCategory[$CgPhase];
	Request($CgNutBase, UnClickable);//ページ選択が無い場合コメントアウト
	$nut=$CgNutBase+"/*/nut";
	Request($nut, Erase);//ページ選択が無い場合コメントアウト
	$CgCateNut=$CgNutBase+"/img2";
	Fade($CgCateNut, 0, 1000, null, true);

	//ページボタン
	$CgPageOK1=false;
	$CgPageOK2=false;
	$CgPageOK3=false;
	$CgPageOK4=false;
	$CgPageOK5=false;
	$CgPageOK6=false;
	$CgPageOK7=false;
	$CgPageOK8=false;
	$CgPageOK9=false;
	$CgPageOK10=false;

	$nut="CgP*/*/*";
	Request($nut, UnClickable);
	$nut="CgP*/*/*";
	Request($nut, Erase);
	$nut="CgP*/*";
	Request($nut, Erase);

	$CgWhile=1;
	while($CgOverPage>$CgWhile){
		$CgNutBase="CgP"+$CgWhile;
		Request($CgNutBase, Clickable);
		$nut=$CgNutBase+"/img";
		Fade($nut, 0, 1000, null, true);
		Request($nut, Enter);
		$nut=$CgNutBase+"/MouseOver/nut";
		Request($nut, Enter);
		$nut=$CgNutBase+"/MouseClick/nut";
		Request($nut, Enter);
		VariableValue($,"CgPageOK"+$CgWhile,true);
		$CgWhile++;
	}
	$CgNutBase="CgP"+$CgPage;
	Request($CgNutBase, UnClickable);//ページ選択が無い場合コメントアウト
	$nut=$CgNutBase+"/*/nut";
	Request($nut, Erase);//ページ選択が無い場合コメントアウト
	$CgPageNut=$CgNutBase+"/img2";
	Request($CgPageNut, Enter);
	Fade($CgPageNut, 0, 1000, null, true);

	//カテゴリオリジナル
	Fade("CgGround*", 0, 0, null, false);
	$CgGroundNut="CgGround"+#CgCategory[$CgPhase];

	if($CgFirst){
		Fade("CgPlate", 0, 0, null, true);
		Move("CgPlate", 0, @50, @0, Axl1, true);

		Fade("Cg*/img", 0, 0, null, true);
		Fade("Cg*/img2", 0, 0, null, true);
		Fade("CgBase", 0, 0, null, true);

		Fade("CgExit/img", 0, 1000, null, true);

		//描画
		Fade("@スクリーン", 300, 0, null, false);
		Move("CgMati", 300, @0, 0, Dxl1, true);

		Fade("Cg*/img", 200, 1000, null, false);
		Fade("CgBase", 200, 1000, null, false);
		Fade($CgCateNut, 200, 1000, null, false);
		Fade($CgPageNut, 200, 1000, null, false);
		Fade($CgGroundNut, 200, 1000, null, true);

		Move("CgPlate", 300, @-50, @0, Dxl1, false);
		Fade("CgPlate", 300, 1000, null, true);

		Delete("@スクリーン");
		$CgFirst=false;
	}else{
		Fade($CgGroundNut, 0, 1000, null, true);

		Fade("CgScreen", 300, 0, null, true);
		Delete("CgScreen");
	}


	//★選択開始
	$GalleryWhile=true;
	while($GalleryWhile){
		$SelectCgIco=0;
		select{
			//★キーダウン系
			if($SYSTEM_keydown_f){
				if(!#SYSTEM_window_full_lock){
					#SYSTEM_window_full=!#SYSTEM_window_full;
					#SYSTEM_window_full_lock=false;
					Wait(300);
					$SYSTEM_keydown_f=false;
				}
			}else if($SYSTEM_keydown_e){
				if(!$SYSTEM_twitter_lock){
					call_chapter nss/sys_twitter.nss;
				}
			}else if($SYSTEM_r_button_down){
				$GalleryWhile=false;$CgLoop=false;break;
			}
	
			case Cg1{$SelectCgIco=1;
			}case Cg2{$SelectCgIco=2;
			}case Cg3{$SelectCgIco=3;
			}case Cg4{$SelectCgIco=4;
			}case Cg5{$SelectCgIco=5;
			}case Cg6{$SelectCgIco=6;
			}case Cg7{$SelectCgIco=7;
			}case Cg8{$SelectCgIco=8;
			}case Cg9{$SelectCgIco=9;
			}case Cg10{$SelectCgIco=10;
			}case Cg11{$SelectCgIco=11;
			}case Cg12{$SelectCgIco=12;
			}case Cg13{$SelectCgIco=13;
			}case Cg14{$SelectCgIco=14;
			}case Cg15{$SelectCgIco=15;
			}case Cg16{$SelectCgIco=16;
			}case Cg17{$SelectCgIco=17;
			}case Cg18{$SelectCgIco=18;
			}case Cg19{$SelectCgIco=19;
			}case Cg20{$SelectCgIco=20;
			}

			if($CgPageOK1){case CgP1{$CgPage=1;$GalleryWhile=false;}}
			if($CgPageOK2){case CgP2{$CgPage=2;$GalleryWhile=false;}}
			if($CgPageOK3){case CgP3{$CgPage=3;$GalleryWhile=false;}}
			if($CgPageOK4){case CgP4{$CgPage=4;$GalleryWhile=false;}}
			if($CgPageOK5){case CgP5{$CgPage=5;$GalleryWhile=false;}}
			if($CgPageOK6){case CgP6{$CgPage=6;$GalleryWhile=false;}}
			if($CgPageOK7){case CgP7{$CgPage=7;$GalleryWhile=false;}}
			if($CgPageOK8){case CgP8{$CgPage=8;$GalleryWhile=false;}}
			if($CgPageOK9){case CgP9{$CgPage=9;$GalleryWhile=false;}}
			if($CgPageOK10){case CgP10{$CgPage=10;$GalleryWhile=false;}}

			case Cg2D{
				$CgPhase=0;$CgPage=1;
				$GalleryWhile=false;
			}case Cg3D{
				$CgPhase=1;$CgPage=1;
				$GalleryWhile=false;
			}case CgBG{
				$CgPhase=2;$CgPage=1;
				$GalleryWhile=false;
			}case CgExit{
				//Request("@決定サウンズ", Stop);
				//SetVolume("@決定サウンズ", 0, 1000, NULL);
				//Request("@決定サウンズ", Play);
				$GalleryWhile=false;$CgLoop=false;break;
			}case CgNext{
				//Request("決定サウンド", Stop);
				//Request("決定サウンド", Play);
				$GalleryWhile=false;
				$CgPage++;
				if($CgPage==$CgOverPage){$CgPage=1;}
			}case CgBack{
				//Request("決定サウンド", Stop);
				//Request("決定サウンド", Play);
				$GalleryWhile=false;
				$CgPage--;
				if($CgPage==0){$CgPage=$CgMaxPage;}
			}
		}

		if($SelectCgIco!=0&&VariableValue($,"CgCheck"+$SelectCgIco)){
			CgFade();
		}
	}
}


..//●選択後動作
function CgFade()
{
	$CgFadeBreak=false;

	$CgNumber=$SelectCgIco+(($CgPage-1)*$CgMaxCount);
	$CgName=#CgCategory[$CgPhase][$CgNumber];

	$CountWhile=#Cg要素数;
	while(Count(#Cg[$CgName])>$CountWhile){

		//黒枠処理
		if($CountWhile>#Cg要素数){
			$PreCountWhile=$CountWhile-1;
			if(VariableValue(#,#Cg[$CgName][$PreCountWhile])==false&&VariableValue(#,#Cg[$CgName][$CountWhile])==false){
				CreateColor("CgBlack", 3000, 0, 0, 1024, 576, "BLACK");
				Fade("CgBlack", 0, 0, null, true);
				Fade("CgBlack", 150, 1000, null, true);
			}
		}

		if(VariableValue(#,#Cg[$CgName][$CountWhile])){
			//文字列判定
			if(Strstr(#Cg[$CgName][$CountWhile], "ev")){
				$index="ev";
			}else if(Strstr(#Cg[$CgName][$CountWhile], "img")){
				$index="img";
			}else if(Strstr(#Cg[$CgName][$CountWhile], "obj")){
				$index="obj_ex";
			}else{
				$index="bg";
			}
			//パッチ用
			$PatchA=#Cg[$CgName][$CountWhile];
			if($PatchA=="ev136_戦闘解説ＶＳ首領編３_d"||$PatchA=="ev163_真っ二つの正宗_c"||$PatchA=="ev221_月明かりを浴びて立つ光_a"||$PatchA=="ev221_月明かりを浴びて立つ光_b"||$PatchA=="ev222_茶々丸Ｈ_c"||$PatchA=="ev222_茶々丸Ｈ_d"||$PatchA=="bg031_八幡宮境内_03"){
				$head="cg2/";
			}else{
				$head="cg/";
			}
			$img=$head+$index+"/"+#Cg[$CgName][$CountWhile]+".jpg";
		}else{
			$img="NoData";
		}
		$nut="CgTex"+$CountWhile;
		CreateTexture($nut, 3000, 0, 0, $img);
		Fade($nut, 0, 0, null, true);

		//長物位置調整
		$nutH=ImageHorizon($nut);
		$nutV=ImageVertical($nut);
		if($nutV>576){
			$BaseNutV=$nutV-576;
			$MovePointV=-($BaseNutV);
			if(#Cg[$CgName][1]=="Vr"){
				Move($nut, 0, @0, $MovePointV, null, true);
				$MovePointV=0;
			}
				$MoveTime=$BaseNutV*12;
				$MovePointH=0;
		}else if($nutH>1024){
			$BaseNutH=$nutH-1024;
			$MovePointH=-($BaseNutH);
			if(#Cg[$CgName][1]=="Hr"){
				Move($nut, 0, @0, $MovePointH, null, true);
				$MovePointH=0;
			}
				$MoveTime=$BaseNutH*12;
				$MovePointV=0;
		}

		//通常描画
		Fade($nut, 500, 1000, null, false);
		WaitKey(500);
		Fade($prenut, 0, 0, null, false);
		Fade($nut, 0, 1000, null, true);
		Delete($prenut);
		CgCansel();
		select{
			if($SYSTEM_r_button_down||$SYSTEM_keydown_ctrl||$SYSTEM_keydown_space){$CgFadeBreak=true;break;}
			else if($SYSTEM_l_button_down||$SYSTEM_keydown_enter){break;}
		}
		if($CgFadeBreak){break;}

		//長物描画
		if($nutV>576||$nutH>1024){
			Move($nut, $MoveTime, $MovePointH, $MovePointV, null, false);

			$cgwait=false;
			CgCansel();
			select{
				Position($nut,$nutX,$nutY);
				if(($MovePointH==$nutX)&&($MovePointV==$nutY)){
					if($SYSTEM_r_button_down||$SYSTEM_keydown_ctrl||$SYSTEM_keydown_space){
						$CgFadeBreak=true;break;
					}else if($SYSTEM_l_button_down||$SYSTEM_keydown_enter){
						break;
					}
				}else{
					if($SYSTEM_r_button_down||$SYSTEM_keydown_ctrl||$SYSTEM_keydown_space){
						Move($nut, 0, $MovePointH, $MovePointV, null, true);
						CgCansel();
					}else if($SYSTEM_l_button_down||$SYSTEM_keydown_enter){
						CgCansel();
						if($cgwait){
							$nutmx=$MovePointH-$nutX;
							$nutmy=$MovePointV-$nutY;
							if($nutmx<0){$nutmx=-$nutmx;}
							if($nutmy<0){$nutmy=-$nutmy;}
							if($nutmx!=0){
								$MoveTime=($BaseNutH*12)*($nutmx/$BaseNutH);
							}else if($nutmy!=0){
								$MoveTime=($BaseNutV*12)*($nutmy/$BaseNutV);
							}
							Move($nut, $MoveTime, $MovePointH, $MovePointV, null, false);
							$cgwait=false;
						}else{
							Move($nut, 0, @0, @0, null, true);
							$cgwait=true;
						}
					}
				}
			}
		}
		if($CgFadeBreak){break;}

		$prenut=$nut;
		$CountWhile++;
	}
	Delete("CgBlack");

	Fade($nut, 300, 0, null, true);
	Delete($nut);
	$prenut=0;

	$SelectCgIco=0;

	CgCansel();
}

function CgCansel(){
	$SYSTEM_keydown_enter=false;
	$SYSTEM_keydown_ctrl=false;
	$SYSTEM_l_button_down=false;
	$SYSTEM_r_button_down=false;
	$SYSTEM_keydown_space=false;
}


